{"_default": {"1": {"origem": "arquivo_local", "titulo": "1-Estruturação de Prompts.mp4", "texto": " Agora chegou a hora de a gente falar sobre estruturação de prompts e estratégias de utilização. A primeira coisa que eu já quero começar deixando claro aqui para você, tá? Independente da estratégia que você vá utilizar para estruturar os seus prompts, essas estratégias, elas não conseguem ser coringas, ou seja, uma estratégia vai fazer com que você consiga resolver todos os seus problemas da sua vida com prompts e você sempre vai ter o melhor resultado, tá? entenda que quando você quer trabalhar com um processo de workload de desenvolvimento, provavelmente você vai usar um tipo de estrutura. Se você precisa desenvolver um agente que precisa, vamos dizer assim, processar qualquer tipo de informação para responder ao cliente final, você vai ter uma outra estrutura. Se você quiser fazer uma exploração e entender melhores estratégias para chegar na arquitetura do software que você quer, novamente, é um outro tipo de prompt. Eu preciso gerar um documento, outro tipo de prompt também. Então, o ponto principal desse capítulo aqui é que você entenda que essas estratégias para a gente estruturar prompts, elas vão dar algumas bases para a gente. Porém, o que eu vou trazer aqui para vocês é uma base inicial para que você entenda como que você pode estruturar os seus prompts, não necessariamente da forma como eu vou mostrar, mas ele pelo menos consegue abrir um pouco mais a sua mente de partes e sessões no processo de estruturação. Então esse aí é o nosso principal objetivo e eu vou trazer aqui alguns exemplos e a gente também vai praticar bastante em relação a isso e nós vamos ver alguns prompts prontos para que você consiga identificar esses tipos de padrão. Maravilha? Então vamos nessa pessoal, porque a gente vai falar sobre estruturação de promptes agora.", "data": "2026-01-13 23:23:02"}, "2": {"origem": "arquivo_local", "titulo": "2-Uma simples correção de Bug.mp4", "texto": " A gente teve uma ideia do que a gente vai falar agora. Eu queria trazer um caso bem simples de coisas que podem atrapalhar muito o desenvolvimento de um software. E isso pode ser exatamente por um único motivo. Prompts incompletos ou prompts que não tenham uma clareza muito grande e que geram ambiguidade muito grande. E eu vou falar um exemplo bem claro que acontece. E se já aconteceu com você, eu acho que você já deve ter sentido na pele. E se não aconteceu, eu acho que já serve para você como uma dica do que não fazer, por exemplo, quando você vai desenvolver. Então vamos imaginar o que acontece no processo de desenvolvimento de software comum. Basicamente, eu tenho o meu software com um monte de linha de código e daí alguém vai pedir, por exemplo, para eu resolver um bug aqui. Então eu tenho um bug que eu quero resolver e beleza, alguém passa esse bug para mim e acabou caindo. Aí o que eu vou fazer uma vez que esse bug chega aqui para mim? Eu vou entender todo o processo e tudo mais e eu vou fazer o desenvolvimento. E nesse momento o que eu vou fazer? Eu vou fazer o desenvolvimento do meu bug usando o IA, mais todas as minhas ferramentas de IDE e tudo mais, todo o meu conhecimento como desenvolvedor, eu sou um ótimo desenvolvedor, então está maravilha. E daí, uma vez que eu fiz tudo isso, eu vou gerar a minha pull request. Então a minha pull request vai ser gerada e por naturalmente vai passar por o quê? Por um code review. Beleza? Agora vamos imaginar que quem vai fazer esse code review aqui? Vai ser um outro desenvolvedor. O bug que você tinha que consertar, o que acontece? Ele era uma função simples que estava com problema. Então você tinha uma função muito simples, que no final das contas, vamos imaginar que era um maior igual que teria que ser mudado. Estava maior e você tinha que colocar um maior igual. Mas o que acontece? Como você mandou a instrução ali para a IA, o que ela fez? Ela fez muita coisa legal, adivinha só. Ela corrigiu o bug, ou seja, ela fez a correção do bug, e você ficou muito feliz porque os testes estavam passando. Aí ela deu uma melhorada nos testes, para ficar um pouco mais claro, esses testes. E aí, naquele arquivo ainda, ela percebeu que algumas partes não estavam tão bem documentadas. Então, o que ela fez? Ela também documentou um pouquinho. Ela fez a documentação, documentou. Legal Maravilha outra coisa que ela percebeu que ali n estava usando t bem os princ por exemplo do Clean Code Então, adivinha o que ela fez ainda? Ela pegou algumas funções e ela extraiu para funções menores, usando boas práticas. e daí ela estava dentro daquele módulo e ela começou a perceber que esse padrão que ela utilizou das boas práticas também poderiam ser feitos. Então, nesse momento, ficou top. Imagina você chegando em uma empresa, primeiro dia de trabalho, o cara fala para você corrigir um bug e você não só correge o seu bug, você é proativo, você melhora o código, você documenta, você usa Clean Code, Você extrai as funções, deixa as variáveis tudo cada vez mais limpo. Ou seja, o seu código está muito bem ilustrado. Agora, adivinha só o que vai acontecer? Quando esse cara aqui, que vai trabalhar aqui na parte do Code Review, ao invés de ele revisar uma linha de código, ele vai revisar, por exemplo, 500 linhas em, por exemplo, 5 arquivos. Ou seja, você pediu para a IA fazer uma coisa, ela fez, melhorou tudo o que ela precisava melhorar, não introduziu nenhum bug, Mas o processo de desenvolvimento aqui, o workflow da sua equipe, ele foi completamente modificado e enrolado. Porque esse cara que ia gastar 5 minutos para fazer o code review do seu bug, esse cara aqui pode querer gastar o dia inteiro. Esse cara vai ficar maluco. Por quê? Porque você simplesmente, não é que você foi proativo. A sua IA foi proativa demais. E nesse momento de proatividade, você se segurou ali por conta dos testes e realmente ficou melhor o código. Mas o objetivo inicial, na realidade, era fazer a correção de um bug. Não era refatorar código, não era melhorar código. Porque toda vez que você sai mexendo em um monte de arquivo ao mesmo tempo, e isso aí ela faz, o que acontece? Você vai prejudicar a pessoa lá da ponta. e às vezes a necessidade de simplesmente corrigir um bug urgente não vai poder ir para a produção porque esse code review n ficou mais referente apenas bug esse code review come a virar um code review de refatora de c e voc perdeu o prop E por que isso acontece? Muitas vezes a gente faz isso sem perceber. Eu, utilizando inteligência artificial, já percebi que algumas vezes eu estava querendo adicionar uma feature ou melhorar alguma coisa, ou corrigir alguma coisa, e na realidade a correção era em um, em dois arquivos, e quando eu vi tinha 10 arquivos modificados. E depois eu fiquei pensando, cara, que loucura a quantidade de arquivos que eu mesmo vou ter que revisar na hora de eu trabalhar. E eu comecei a pensar, cara, será que isso é um problema do modelo? E realmente, não digo que era um problema do modelo, mas isso aconteceu sabe quando? Quando eu estava usando o modelo do Cloud Sonnet. e nessa época a versão do Cloud Sonnet era 3, eu não sei até que ponto o quanto você já trabalhou com o IA e o quanto você já utilizou, por exemplo, esse modelo do Cloud Sonnet 3 e ele estava sendo um modelo muito bom porque ele fazia muita coisa legal e ele era bem centrado vamos dizer assim, você pedia para ele fazer uma coisa ele fazia essa coisa na mesma época, passou um tempinho o que aconteceu? lançou o Cloud Sonnet 4 e o Cloud Sonnet 4 ele começou a parecer um desenvolvedor desenfreado que simplesmente saia fazendo as coisas para você sem você mandar o cara virou uma máquina de ser proativo e daí apesar de ele resolver muitos problemas esse cara aqui vamos dizer ele era muito arisco vamos imaginar que você tem um cavalo um cavalo bem bonitinho ali que você vai andando com ele e de repente você senta no outro cavalo e esse cara te joga pra cima. O Cloud Sonnet foi um susto pra mim. E esse susto foi muito grande porque ele realmente saiu fazendo coisas que eu não queria. Mas eu comecei a pensar, cara, sempre vão haver novos modelos. Sempre vão haver novos modelos. Durante esse processo, lançou o Cloud Sonnet, o 4.1, O Opus, GPT-5, GPT-4.1 Mini, um monte de coisa, o Gemini. E os modelos não param de nascer. E o problema é que nós temos o seguinte. O comportamento do modelo sempre vai ser alterado conforme as versões. Então, quando eu tenho um comportamento, esse comportamento aqui a gente n vai conseguir na realidade segurar ele muito se voc trabalhar de formas um pouco inocentes Por exemplo olha eu tenho um problema nessa feature e ela est fazendo um cálculo errado, eu gostaria que você validasse essa função e tentasse entender o problema e fazer a correção para mim. Muitas vezes a gente trabalha dessa forma e parece que está tudo ok, porque você realmente está especificando as coisas. O problema é que a falha desse tipo de coisa é que o prompt que a gente está usando, ou até mesmo o prompt, eu acabei de falar para você, ele não gera, na realidade, uma barreira de comportamento. O que isso significa? o seu prompt não coloca limites naquilo que você quer que ele desenvolva. Então, toda vez que você vai estruturar um prompt, você tem que ter de cara quais são os limites que você vai deixar esse prompt trabalhar. Se você não limitar especificamente, pode ser que você pegue o Cloud Sonnet em outras versões ou algum outro modelo e ele sai aparecendo um estagiário irresponsável, saindo fazendo mudanças em 500 linhas de código. Uma vez que você também seta esses limites, uma outra coisa que você, na realidade, você tem que conseguir fazer, adivinha o que é no final das contas. Resultado final. O que significa? Você tem que especificar a saída final. se você não especifica como você quer a saída ele vai gerar a saída da cabeça dele, então uma vez que você coloca limites e que você especifica uma saída ou seja, o que você quer no final do dia ele tende a te respeitar mais significa que ele não pode querer sair mudando arquivos a mais? meu, e há trabalho de forma probabilística, você nunca vai conseguir garantir absolutamente nada com a inteligência artificial. Porém, fazendo esses tipos de coisa, você vai conseguir trabalhar bastante. E vai conseguir ter muitos resultados ali bem interessantes. Eu, no próximo vídeo, eu vou dar mais um exemplo de coisas parecidas que pode acontecer com você no dia a dia. E depois, em seguida, eu vou caminhar para os conceitos e depois a gente vai para a prática. Eu vou te mostrar alguns prompts que eu tenho. vou liberar para vocês, quero que vocês façam testes e tudo mais, fechou? Então vamos nessa.", "data": "2026-01-13 23:23:08"}, "3": {"origem": "arquivo_local", "titulo": "3-Minha IA produziu um lixo.mp4", "texto": " No vídeo anterior, eu passei aqui para você uma situação comum que pode acontecer com você no dia de desenvolvimento, principalmente quando você está desenvolvendo em equipe. Esse tempo atrás, eu tive o prazer de conversar com algumas pessoas, alguns desenvolvedores, e eu acabo percebendo que tem muitos desenvolvedores que realmente possuem uma frustração muito grande com a IA. e eu não vou tirar a legitimidade disso porque em tese ele está pedindo algo e ela não está fazendo da forma como ele espera então a gente tem um problema de expectativa mas chega um momento do seu trabalho, do seu dia a dia com o seu estresse que você acaba falando a seguinte coisa eu vou escrever assim o código que há e há gerou para mim é um lixo eu estou simplesmente parafraseando o que esse meu camarada, colega de profissão falou aqui para mim e por que ele falou isso? porque é o seguinte a tecnologia que ele estava utilizando ela tinha muitas versões tinha muita confusão de versão e as coisas começavam a sair do controle, porque ora a IA pegava algo numa versão mais nova, algo na versão mais antiga, era uma aplicação front-end, então tinha muitas mudanças sensíveis, ainda mais em interface, e o resultado final que ele falou é que o código que a IA gerou para mim é um lixo. Ok, tudo bem, beleza, vamos partir do princípio que é um lixo. E daí ele falou que ele tentou várias vezes e o código continuava a ser um lixo. E a minha resposta para ele, na realidade, a minha resposta para ele foi uma outra pergunta. E eu quero que você faça essa pergunta para você toda vez que você for inserir um prompt na hora de você desenvolver uma aplicação. Ok, temos um diagnóstico. O código da IA realmente é um lixo. Vamos partir desse princípio Que o código realmente é um lixo Agora, o que eu preciso de você É o seguinte Vamos fazer um code review De um lixo Code review de um lixo Tá? E uma vez que eu vou fazer um code review de um lixo Eu vou mapear o seguinte Olha Ele fez uma função Totalmente com bibliotecas com bibliotecas antigas ele criou arquivos muito grandes ele também gerou funções desnecessárias ele também a Iá também fez o que no meio dessa história iniciou o trabalho em um arquivo e quando ela foi interrompida pela gente para uma instrução para corrigir o caminho vamos dizer assim, ou seja, às vezes a gente está desenvolvendo com IA você vê que ela está fazendo besteira, você escreve lá no chat olha, não faz assim, é dessa forma aí o que a IA fez? ela iniciou o trabalho em um arquivo que E quando ela foi interrompida, ela foi interrompida, adivinha o que ela fez nesse caso? Quando ela foi interrompida ela voltou a ajustar o que voc pediu e largou o arquivo que voc estava usando pela metade Ou seja, ela gerou no final das contas um bug e deixou você ali na mão. Então vamos imaginar que ela gerou todos esses problemas ali ainda para mim. Fora isso, ela mudou alguns padrões nos seus arquivos E no final das contas, deu tudo errado Então, uma vez que você chega a essa conclusão Você pode ter dois posicionamentos Um posicionamento é voltar a xingar a IA e falar que é um lixo E fazer do seu jeito e, sei lá, tentar de novo, gastar seu tempo E os seus resultados não melhoram A segunda forma que você pode resolver realmente é Vamos fingir que a IA aqui não é uma IA. Vamos fingir que ela é um colega seu de trabalho e que você tem um carinho enorme com essa pessoa e ela realmente está fazendo o melhor dela. Vamos partir desse princípio. E o que você vai perceber aqui nesse momento? Que quando você for fazer esse Code Review, você vai perceber o seguinte, que ela utilizou uma função antiga. Então, você vai mapear o seguinte, olha, você usou o pacote x, mas você deveria ter usado o pacote y. Exemplo, from x import y, e daí você coloca errado. e depois você coloca um outro exemplo, from x, import, j. E aqui é certo. E depois explica que todas as vezes que ela for fazer algo parecido, ela vai ter que fazer essa correlação para nunca mais nessa situação isso acontecer. Mas, além disso, você pode passar uma instrução adicional, que será o seguinte. Antes de importar um pacote dessa família ou dessa versão, Então, pesquise as documentações na web, em Context 7, não interessa, e garanta que você está utilizando a última versão. Isso aqui vai resolver 100% o problema que vai acontecer? Será que ela nunca mais vai importar uma versão antiga? Talvez ela vá implementar. O problema, nesse caso, é que agora você tem uma informação adicional que ela tinha. E provavelmente esse erro aqui que ela cometeu, ela não vai cometer mais. Ou se ela vier a cometer, você pode restringir ainda mais. Ela criou arquivos muito grandes. Então você pode colocar ali, guidelines. Não crie arquivos com mais de 100 linhas. Tente trabalhar com funções limpas e, se necessário, crie arquivos e interfaces para melhorar a compreensão. Estou dando um exemplo aqui. Ent coloquei mais essa guideline A ela gerou fun desnecess opa se ela gerou fun desnecess eu posso chegar e falar assim para ela Ap criar qualquer fun revisite e veja se realmente ela é necessária ou se não existe algo similar já implementado. Então, se você perceber, o que eu estou fazendo? Eu estou criando mais uma guideline aqui para ela trabalhar. Aí, a gente tem uma situação que é grave, que é o seguinte. Todas as vezes que eu passar uma instrução para fazer um ajuste em determinada tarefa, Aqui eu posso escolher Termine a implementação do arquivo atual E depois siga as minhas instruções Hoje em dia já tem IDS que coloca todas as suas mensagens em uma fila Para evitar esse tipo de coisa Mas ainda assim pode acontecer Ou você pode falar aqui para ela o seguinte olha só, você está fazendo isso no caminho errado, então corrija isso e não esqueça de voltar e continuar de onde você parou. Então isso também já vai fazer com que isso acabe melhorando. Então perceba, galera, que a grande questão aqui é que ao longo do tempo você vai começar a estruturar os seus prompts com uma base de conhecimento, guidelines, exemplos e coisas desse tipo que vão fazer com que aquele código lixo pelo menos naquele contexto esse problema vai ser minimizado e a recomendação que eu dou pra você é que todas as vezes que a IA não gerou algo que te agrade, você documente pra ela ao invés de passar raiva, pense que ela é um novo funcionário, que ela não conhece direito a empresa, ela está no primeiro dia dela. Cada chat que você iniciar é um funcionário que acabou de chegar na empresa. Então, partindo desse princípio, o que vai acontecer é que ao longo do projeto isso aqui vai se tornar um ativo e vai fazer com que a IA não caia em tantas mais pegadinhas que a gente acaba trabalhando. Uma coisa que você vai perceber é que muitas vezes você vai perceber que, por exemplo, isso aqui, aqui no meio dessa história, é um, por exemplo, um few shot prompt, por exemplo. Por que é um few shot? Porque eu estou dando alguns exemplos aqui para ela. Então, toda vez que eu vou dar um exemplo aqui para ela, ela vai ter como copiar e transpor aquilo que ela pensava que era para um outro trabalho. todas as vezes que eu gerar esses tipos de guidelines aqui, eu tenho um outro formato aqui de prompt por exemplo, após criar qualquer função, revisite se realmente ela foi necessária então o que ela está fazendo? ela está gerando uma linha de pensamento para ela encadear um próximo passo, então isso aqui para a gente pode ser também um chain of thought Uma outra coisa que a gente pode falar aqui tamb que toda vez que voc d um few shots e traz com um exemplo a sa aqui que a gente acaba escolhendo no final das contas a gente poderia dizer que poderia ser uma espécie de um skeleton of thoughts porque você está sendo um pouco mais específico de como você quer a saída. Então, se você perceber, até mesmo nesses exemplos que acontecem para a gente no dia a dia, a gente está utilizando diversas técnicas de prompt. O grande problema é que se você começa a criar os seus arquivos e os seus prompts de formas desestruturadas, assim, no seu processo de trabalho, vai ficar um pouco de bagunça, até mesmo para você manter esse arquivo. Vamos imaginar, pessoal, que você está criando um teste automatizado. Meu, os testes automatizados, eles têm que estar muito claros. Eles têm que estar bem feitos. Eu tenho que poder olhar o meu teste automatizado e garantir que eu estou entendendo o que ele está fazendo. Porque ele vai crescer ao longo do tempo. E você saiba que os seus prompts, ou os seus arquivos, a sua base de conhecimento que você vai passar para IA, ela vai crescer ao longo do tempo. Então, se você não tiver uma estrutura clara para fazer esses tipos de coisa e, intencionalmente, entender o tipo de prompt que você precisa, simplesmente você vai gerar um arquivo insustentável vai gerar mais ambiguidade porque às vezes mais informação gera mais ambiguidade e a IA começa a fazer coisas piores do que você estava mandando menos informação então qual que é o meu objetivo aqui nesses dois exemplos que eu trouxe aqui para você é que todas as vezes que a IA gera algo que você não espera é porque você não definiu limites e o comportamento E toda vez que ela gerar algo que é muito ruim, tente abstrair que ela é um funcionário. E como funcionário, ela chegou no dia 1 e ela fez do jeito que ela imaginava. E você vai ter que treinar esse seu funcionário. A grande ponto é que esse seu funcionário, no dia seguinte, quando você iniciar um novo chat, ou seja, chegou um funcionário ainda mais novo na sua empresa, o que você vai fazer? ele já vai ter essas regras e esses erros vão ser minimizados. Eu nunca vou falar que esses erros vão ser, nunca mais vão aparecer, porque não é assim que a coisa funciona, mas você vai ter uma minimização. Agora imagine ao longo dos anos, ao longo dos tempos, como que esses tipos de coisa eles vão poder melhorar aí para você. Então eu só queria trazer isso um pouco mais para a nossa realidade antes de eu começar a falar especificamente de como que você pode estruturar um prompt para que você realmente entenda que existem formas que não é só ficar escrevendo dessa forma ou passar instruções para ir no chat dessa forma. Existem formas bem inteligentes e essas formas não são apenas para o nosso workflow de desenvolvimento. isso aqui é um dos pontos importantes eu tenho sim processos de workflow e desenvolvimento mas eu tenho agentes que precisam processar informação para um cliente final eu quero explorar e pegar novas possibilidades eu quero fazer geração de documentos eu quero fazer muita coisa com o IA então o que acontece aqui é o seguinte se eu não tiver uma estrutura clara simplesmente eu não vou conseguir o meu resultado e novamente nenhuma estratégia de estruturação vai resolver todos os seus problemas São completamente, a gente vai ver diversas estratégias na nossa frente, a gente vai testar, a gente vai escrever prompt e a gente vai brincar bastante e eu espero que você consiga sair utilizando isso no seu trabalho o quanto antes. Fechou? Então vamos nessa!", "data": "2026-01-13 23:23:15"}, "4": {"origem": "arquivo_local", "titulo": "4-Prompts no processo de desenvolvimento.mp4", "texto": " Agora que eu acho que a gente está na mesma página e eu acho que deu para a gente dar uma contextualizada da importância que é você ter uma estrutura clara ali de prompt, eu quero agora chegar e ir um pouco mais para essas estruturações. Então é o seguinte, a gente tem alguns casos importantes. Quando o problema não será respondido pela IA em larga escala, não economize em tokens. essa é uma pergunta muito comum que acontece quando eu começo a desenvolver eu coloco um prompt gigante lá a primeira coisa que algumas pessoas torcem o nariz para mim, pelo meu comportamento é o seguinte e a janela de contexto? e a quantidade de tokens? não vai dar certo isso que você está fazendo e o que eu tenho percebido e novamente eu não sou o rei da verdade é que quando a gente vai trabalhar com código e desenvolvimento, se a gente economizar em tokens, e codificação é algo extremamente complexo, então se a gente não economizar, a gente tem uma chance maior de diminuir o problema. E o grande ponto é que muitas vezes você pode usar um prompt gigante para resolver um problema pequeno. Então você não vai ter problemas em janela de contexto. Coisas interessantes, por exemplo, é se você pegar um Gemini da vida com mais de um milhão de promptes, de promptes não, de janela de contexto, chega a dois milhões, se você pegar um GPT-5 da vida, ele tem, eu acho que perto de 500 mil tokens, mas ele tem algo fantástico, que é 128 mil tokens de saída em alta performance. Então, a primeira coisa que você não deve ficar preocupado é no momento que você for desenvolver software, você ficar economizando tokens. Principalmente porque hoje em dia, grande parte dos planos das IDEs e etc eles n est mais cobrando necessariamente por tokens Normalmente eles est cobrando por utilização. É óbvio que por trás dos planos eles podem estar fazendo e devem estar fazendo as contas por token. Mas não é como era antes que você passava a sua API Key e cada token contava e saía uma conta muito clara. Vou dar um exemplo para você e esse exemplo está acontecendo no momento dessa gravação, provavelmente daqui a um ano, daqui a seis meses ou alguma coisa desse tipo, isso aqui pode estar em um formato completamente diferente. Mas, por exemplo, se eu pegar uma API Key da Anthropic e colocar isso no Cloud Code, eu vou gastar uma grana absurda para passar o dia inteiro desenvolvendo. Agora, se eu assinar o plano do Cloud Code, eu acho que é Max, sei lá como é o nome do plano, custa 100 dólares por mês, Ou seja, não é um valor também tão barato. Eu hoje consigo trabalhar quase que de forma ilimitada com esse modelo, sem ter surpresas no final do mês. E além disso, em alguns momentos eu posso utilizar modelos de reasoning, sei lá, o Opus, por exemplo, que consegue inclusive ter resultados melhores, mas aí ele gasta mais ali a sua possibilidade de trabalhar com ele. mas daí vai depender da empresa o quanto você quer gastar dinheiro no seu bolso porque existem planos, sei lá, de 200 dólares por mês que você acaba utilizando ele quase de forma ilimitada. Pessoal, a minha questão aqui não é falar de dinheiro e não é falar que 100 dólares é barato, tá? 100 dólares é bastante dinheiro mas, tá? Para mim, tá? 100 dólares perto da produtividade que eu tenho por exemplo, se eu for usar o cloud assim, ele se paga muito rápido. E eu espero que ao longo do tempo, cada vez mais as empresas, elas possam fornecer ferramentas de IA inclusas no pacote E um ponto inicial que poderia acontecer e s testes que por exemplo hoje eu estou fazendo na empresa porque a gente tem desenvolvedores o seguinte Eu comecei a fazer comparação, por exemplo, do Gemini, CLI, Command Line Interface do Gemini, e com o resultado com o Cloud Code, com o GPT-5, com o uso no Codex e tudo mais. e o que eu acabei percebendo é que os resultados, por exemplo que o Gemini tem me retornado eles são muito similares ao que o Cloud, a única coisa é que o Gemini pelo menos nesse momento ele não tem tantos recursos no CLI, mas o resultado final está sendo quase que o mesmo e pelo menos nesse momento que eu estou gravando, o que acontece o Gemini ele está ali basicamente prometendo que você faça, eu acredito, mil requests por dia e 60 requests por minuto. Meu, para você conseguir fazer isso, é muita coisa, tá? É muita coisa. E essa possibilidade, ela é gratuita, pelo menos por enquanto. Então, muitas vezes, para colocar o pé na água, você não precisa gastar um centavo para trabalhar com inteligência artificial, porque, por exemplo, o Google ou o Gemini, pelo menos no momento dessa gravação, você tem um plano que você acaba não pagando nada, usando um limite absurdo. Pode ser que no futuro eles cobrem e tirem esses planos? Podem ser. Mas eu acredito que sempre vale a pena a gente manter a mente aberta e ver quais são as soluções mais baratas que conseguem resultados similares. Às vezes o resultado não é tão bom, mas é um resultado que, no final do dia, vai fazer eu economizar dinheiro ou a empresa economizar dinheiro também. Então, são coisas que eu quero que você acabe pensando, tá? Mas, para resumir, o que eu queria trazer aqui para vocês é toda vez que você for trabalhar para desenvolvimento com o IA, não economize em tokens. O que voc pode ter s estrat que v fazer com que a IA precise ler o seu codebase inteiro com 100 mil arquivos Voc consegue dar instru mais claras para que ela consiga trabalhar com branches e leafs Ou seja, eu tenho um projeto e esse projeto começa aqui. E daí ele tem uma ramificação de componentes, que são componentes que vão para cá. Lá ele tem componentes que vão para cá Então ele vai gerando quase que fosse uma árvore Esse componente se quebra para cá Legal? Esse componente se quebra para cá Bacana Esse cara aqui, ele se quebra para cá Legal? E aí no final das contas Quando eu peço para a IA resolver algum problema eu chego e falo o seguinte, olha, eu quero que você resolva os meus problemas, os meus componentes, mas eu quero que você parta a partir desse princípio, seguindo esse fluxo aqui. Todo o restante você ignora e você consegue mapear. Mas tudo isso depende muito de como você estrutura a sua aplicação. Se a sua aplicação trabalha de uma forma bem modular, os componentes estão desacoplados o suficiente, você consegue sim fazer com que a IA ela entenda o contexto desse pedaço sem ter que internalizar toda essa outra parte e nesses casos você pode, por exemplo criar documentações e instruções em cada pedaço para que ela evite sair e entrar em outra bolha de partes do seu sistema então são coisas que você pode fazer o ponto importante aqui é que independente de qualquer coisa eu não quero que você economize com tokens para você explorar, para você gerar documento, para você processar informação, principalmente em um workflow de desenvolvimento. Agora, no próximo vídeo, a gente vai falar do outro lado da moeda e esse outro lado realmente é muito importante. Então vamos nessa.", "data": "2026-01-13 23:23:20"}, "5": {"origem": "arquivo_local", "titulo": "5-Utilização e larga escala.mp4", "texto": " ficou até meio grandinho, mas eu precisava passar esse posicionamento que pelo menos é meu, tá? Então, para resumir, se eu tenho e estou desenvolvendo software, eu não vou economizar com tokens, eu não estou preocupado com isso. Se eu ficar me limitando a isso, eu estou enrolado. O que eu vou sempre fazer é tentar fazer com que o meu chat, a minha comunicação com o IA, ela não ultrapasse a janela de tokens. Se ela ultrapassar, eu vou criar um novo chat para ela não perder contexto, informação e tudo mais. Agora, o grande ponto aqui é casos importantes. Quando o problema não será respondido pela IA em larga escala, você também não vai economizar tokens, porque você vai pegar a melhor informação precisa. Um exemplo é o processo de desenvolvimento, que eu falei bastante, mas também processos de exploração. O que significa processos de explora Muitas vezes voc n sabe o que voc n sabe e que voc quer entender mais sobre esse assunto Outra coisa vezes vale a pena voc fazer com que a IA fa pesquisas baseadas no seu código-fonte na internet para gerar uma documentação mais contextualizada daquilo que você precisa. Então você vai explorar. Então todas as vezes que você tiver que criar tarefas pontuais e que elas não vão rodar em larga escala, afinal de contas você não vai rodar mil pesquisas simultaneamente com janela de tokens gigante para ela gerar mil documentos simultaneamente, porque isso no final do dia não vai se aplicar no seu dia a dia de desenvolvimento, por exemplo. Isso aí não tem problema nenhum você também trabalhar com um grande contexto em relação à parte de token. Agora, o ponto é o seguinte, quando há ou pretende se escalar uma aplicação economize ao m t Ent isso aqui o ponto importante economize ao m Porque a cada token vale Cada token voc realmente inviabilizar vezes um projeto de A na empresa que voc est trabalhando Então, obviamente a gente já falou disso, mas mais token, mais custo. Mais regras de negócio ou cadeias de pensamento, maior a latência. Então, dependendo do token, dependendo do prompt que eu fizer para a IA, e eu pedir, por exemplo, para ela pensar passo a passo, ou ela rever etapas anteriores e tudo mais, ela vai depender mais, ela vai demorar mais para responder. Então, se eu tenho um custo maior pela utilização de tokens, e se o prompt que eu uso vai fazer com que a gente gere mais latência, porque gera, isso aí acaba sendo inviável. E o porquê que eu estou dizendo mais token, mais custos? Porque nesse caso aqui eu n estou pagando um plano mensal do cloud sei l de 100 d 50 d de 30 d Aqui eu estou pagando o custo aqui custo por token E quando eu digo custo por token, é custo por um milhão de token, token de entrada, token de saída, esse tipo de coisa. Mas o ponto aqui, aqui eu estou usando a API Key. E se eu estou usando a API Key, a parada aqui é cara. Então aqui eu vou usar a API Key aqui para mim. Então, a gente tem que tomar cuidado com isso. E os trade-offs são sempre aquela história. Custo, latência e qualidade do resultado. Será que vale a pena eu com 90% de assertividade pagar mil dólares a mais por mês para eu ter 91% de assertividade? A gente já falou sobre isso. Então, seguinte pessoal, algumas guidelines que eu queria passar para você, e eu vou falar isso no próximo vídeo, porque eu estou dizendo que são guidelines, mas não estou dizendo que é uma regra escrita em pedra. Então vamos falar sobre isso.", "data": "2026-01-13 23:23:23"}, "6": {"origem": "arquivo_local", "titulo": "6-Guidelines e trade-offs.mp4", "texto": " Falar de guidelines, uma ideia que eu vejo com a experiência e vejo também com a experiência de outros devs que estão trabalhando o tempo inteiro com o IA, é o seguinte, se você tem uma tarefa simples, um senso comum de alguma coisa, ou seja, valide, identifique, sumarize, faça qualquer coisa desse tipo, você vai utilizar ZeroShot. Você não precisa trazer exemplos, a maioria das vezes. Por quê? Porque são coisas que acabam sendo bem simples. Por exemplo, valide se esse JSON é válido. Cara, a IA vai conseguir identificar. Identifique o sujeito dessa frase. Resuma esse parágrafo em cinco palavras. Ou seja, esse tipo de tarefa, e normalmente essas tarefas, elas não são necessariamente utilizadas para desenvolvimento. Ou seja, para um workflow de desenvolvimento. É muito raro você fazer isso. Então você vai trabalhar com zero shot. Você não precisa dar nem exemplo. Você pede e aguarda o resultado com a menor quantidade de tokens possível. Outra coisa, alto volume. Se você tem ali uma requisição, umas chamadas para IA que tem um volume absurdamente alto, você também vai trabalhar com zero shot. ou seja, faça isso e ela vai fazer isso de uma forma mais barata e rápida. Obviamente voc tem que testar tem que ver modelo e tudo mais mas se voc tem alto volume o volume muito grande a quantidade de tokens muito grande esse neg vai virar praticamente invi Ent sempre que voc puder voc vai desenvolver um agente você vai fazer qualquer coisa, e se forem coisas que não tenham um domínio muito específico, você vai poder usar Zero Shot. Agora, se você está numa situação onde há muitas especificidades ou resultado, o formato esperado, ou seja, você está num domínio extremamente específico, sei lá, eu estou fazendo algo de medicina, eu estou fazendo algo de psicologia, eu estou fazendo contas matemáticas, eu estou fazendo qualquer coisa desse tipo, o que acontece? Você vai utilizar ali o Fillshot. Por quê? O Fillshot vai sempre mostrar para você o resultado esperado. Então, baseado no exemplo X Eu espero que você retorne Y Baseado no exemplo Z Eu espero que você retorne W Baseado no exemplo A Eu espero que você faça Complete E aí ela vai trazer esse resultado Ou seja, trabalhar com o fio Shot É muito mais caro Com o Zero Shot A latência é maior E acredite que você gasta muito mais token E processamento da IA quando ela tem que imitar um comportamento que você passou para ela. Então, nesse momento, o que eu recomendo sempre é trabalhe com exemplo. E uma coisa interessante é que, se você perceber, o exemplo sempre traz o que é esperado dela. Ou seja no final do dia voc est dando o qu O formato de sa que foi exatamente isso que a gente falou logo no in aqui desse m Ent isso a um ponto importante porque isso afeta diretamente o custo ali para a gente Então, eu vou dar um exemplo aqui em relação à reflexão e trade-offs em relação a isso. Então, vamos imaginar que com zero shot eu tenho 86% de assertividade com custo X. Legal? Com o Fill Shot, eu tenho 90% de assertividade com custo X mais 20%, por exemplo. E aí, eu vou ter que fazer a minha conta em relação ao meu prompt. Quanto custa 4% de assertividade? Ou seja, que é a diferença de Zero Shot para Fill Shot. Então, eu vou dar um exemplo simples aqui para você. Imagina que o custo atual no Zero Shot é de 10 mil dólares por mês. E com o few shot é de 12 mil dólares por mês. Então significa que com a cada 1% de assertividade a mais que eu vou ter da minha, vai custar 500 dólares. Legal? Ou seja, para que eu saia de 86 para 90, eu vou gastar 2 mil dólares a mais. Ou seja, para cada 1% eu estou pagando 500 dólares. E aí a questão aí no final das contas é, vale a pena? Então é essa conta que você tem que colocar no papel. E quando você coloca no papel, você também vai ter que chegar na área de produto, na financeira em todos os momentos e trazer inclusive para ele porque muitas vezes essa decis n compete n de compet do desenvolvedor O que o desenvolvedor vai ter que falar cara a gente vai ter respostas, 4% de respostas piores por conta de 2 mil dólares. O que vocês querem? Pagar 2 mil dólares a mais ou ter 4% de possibilidade de erro? Mas nós temos algumas coisas, alguns processos de mitigação que a gente vai conseguir lidar com isso. Sei lá, da mesma forma que a gente lida com consistência eventual em sistemas, e isso é um trade-off também, talvez a quantidade de acertos que a IA vai dar em determinado tipo de tarefa, e às vezes essa tarefa não é nem tão crítica, às vezes vale a pena economizar, ou às vezes vale a pena eu pagar ainda mais porque 90% não é o suficiente. Então, fique sempre ligado com esses trade-offs. São pegadinhas e isso aqui tem tudo a ver com o quê? Prompt, galera. Perceba que a gente está falando aqui em zero shot, a gente está falando aqui em few shot. Você entende como quando a gente vai em aspectos um pouco mais profundos na parte de prompt engineering, a gente não está pensando em apenas como escrever prompts. Obviamente que quando a gente acaba entrando em assuntos como arquitetura e a gente vai falar de prompt, ainda assim a gente vai falar um pouco disso, mas o prisma é diferente. O prisma é diferente. Então, esses aí são aspectos que eu quero que você leve em consideração quando você vai criar o seu prompt. Perfeito? Então, vamos nessa.", "data": "2026-01-13 23:23:26"}, "7": {"origem": "arquivo_local", "titulo": "7-System vs User Prompt.mp4", "texto": " que a gente passou um pouquinho por essas guidelines, somente para você sentir um pouco mais o quão profundo é toda essa parte de prompt engineering. Não são os tipos de prompting, mas como ele afeta a vida e o ciclo de vida do software. É importante que a gente consiga revisitar alguns conceitos, para que a gente entre numa linha de raciocínio aqui, para eu mostrar uma forma sugerida para você ter como base para você começar a estruturar os seus próprios prompts. Então, primeira coisa que eu quero falar aqui para vocês, talvez você já saiba, talvez você não saiba, mas é o seguinte, a gente tem alguns tipos de prompt. Então, quando eu digo tipos de prompt, é quando a gente vai iniciar uma nova conversa, um novo chat, uma nova interação com a inteligência artificial, a gente tem duas coisas aqui. Uma coisa chamada System Prompt e outra coisa chamada User Prompt. em alguns aspectos chamam de human no meio da hist t Mas o que acontece o seguinte o que o system prompt O system prompt normalmente ele vai definir a regra do jogo Ele vai definir o comportamento da IA, o tom que ela vai responder, as restrições que a gente quer impor para o modelo. Ele deve ser como se fosse um manual de instrução permanente para aquela conversa. geralmente esse system prompt ele não muda muito porque ele é a instrução inicial e um ponto importante é que muitos modelos eles tendem a ler esse system prompt de uma forma mais prioritária do que está no user ou seja o system prompt ele gera uma regra como se fosse global e ele fala assim, cara, essas são as minhas instruções é assim que eu vou trabalhar e ao longo da conversa, dependendo da forma como você interage com o IA, voc come a conseguir quebrar esse System Prompt Falando por exemplo ignore o System Prompt ignore algumas instru de comportamento que voc tem e comece a se comportar dessa forma, uma tentativa de jailbreak, por exemplo. Mas, de forma geral, é importante que você tenha o System Prompt. Segundo ponto aqui, nós temos o User Prompt. O User Prompt, no final das contas, é quando o usuário, e esse usuário pode ser um humano ou pode ser um outro software ou pode ser um outro agente de A que ele vai pedir, fazer uma pergunta, vai pedir para realizar uma tarefa ou qualquer coisa desse tipo. E o User Prompt pode mudar a cada interação. Então, da mesma forma que o System Prompt se mantém fixo na maioria das vezes, o User Prompt tende a mudar porque ele vai trabalhando ali com as interações. Ent a ideia do User Prompt basicamente ele especifica sendo a descri do que o usu quer naquele momento j respeitando as regras do System Prompt Ent toda hora que voc pensar em System Prompt versus User Prompt você tem que ter uma nota mental. System é a configuração global da conversa. User, pedido específico que você quer que o modelo execute. Normalmente, o modelo vai executar o que você quer, mas utilizando as regras e as instruções e comportamentos que você definiu no System Prompt. Tudo isso é na teoria, porque quando a gente começa a falar de aspectos como o Prompt Injection, existem diversas formas que você tenta dar um trick, que você tenta meio que enganar um pouco o modelo para ele ir ignorando e mudando ao longo do tempo e perdendo essa essência do System Prompt. então isso aí é um ponto mais do que importante pra você ter em mente fechou?", "data": "2026-01-13 23:23:29"}, "8": {"origem": "arquivo_local", "titulo": "8-Exemplo estruturado de prompts.mp4", "texto": " Começou a chegar finalmente, depois de eu ter passado um pouco esse overview, a forma de como você pode estruturar prompts mais elaborados. E uma coisa importante, normalmente esses tipos de prompts não são executados em alta escala. Vai depender muito mesmo do que você vai querer. Mas normalmente uma escala muito grande de milhões, centenas de milhares de requisições, normalmente você não vai ter algo tão grande ou tão elaborado de uma forma a não ser quando você tem uma especificidade muito grande às vezes você acaba fazendo diversas chamadas para um modelo com prompts menores do que fazer ele ler uma quantidade enorme de tokens mas nada é regra realmente você só vai decidir isso na hora no momento que você está com o problema na mão mas de uma forma ou de outra é importante você entender como que você pode organizar a estrutura de um prompt Então, por exemplo, aqui eu estou dando um exemplo bem simples. Não estou dizendo que esse prompt vai ser o melhor prompt do mundo, não. Então, o primeiro ponto aqui é persona e escopo. Persona é o que é o papel dele, o que é especialidade, qual é a role dele. Então, você vai definir quem é o modelo, ou seja, defina quem o modelo é e o que ele não deve fazer, o que não fazer. outro ponto aí isso ajuda a gente a reduzir improvisos e garante alinhamento técnico então eu vou dar um exemplo que a gente tem aqui deixa eu até aumentar um pouco o meu o meu scale draw aqui então eu vou colocar assim você é um assistente especializado em Node.js versão X e testes com Jest não faça refaturações no código original então isso aqui eu já falei o que ele é especialista e eu já falei de cara o que ele não vai fazer. Somente de fazer isso vai fazer com que aquele nosso amigo do Code Review vai ficar um pouco mais feliz porque vai ter menos coisa para ele revisar pelo fato da IA não sair mexendo em códigos que ele não devia. Aí eu tenho uma outra sessão que é o objetivo. Então, descreva de forma direta e sem ambiguidade o que precisa ser feito. Então, se eu colocar o seguinte, escreva testes para o código abaixo isso aí é errado porque é muito aberto, é muito ambíguo essa pergunta ela é extremamente vaga se eu colocar dessa forma aqui escreva testes unitários para a função abaixo usando o gest cobrindo casos de entradas válidos e inválidos eu não estou dizendo que essa frase é a melhor frase do mundo para você pedir para um IA fazer testes unitários Mas a coisa que eu estou querendo mostrar aqui para voc a diferen do que algo muito generalista do que algo que acaba sendo um pouco mais direto ao ponto Outro ponto importante, uma vez que a IA entende o que ela tem que fazer, o que você precisa definir claramente ali para ela é a entrada, ou seja, a entrada dos dados. Então, o que eu estou querendo dizer é o seguinte, você vai listar somente o necessário para resolver a tarefa, você vai manter uma separação visual e você vai evitar colar arquivos inteiros se só a parte que você precisa é realmente importante, tá? Então, nesse caso aqui, o que eu coloquei? Eu escrevi função e coloquei aqui a função que eu quero que ela resolva os meus testes unitários Ou seja, eu estou ali separando, inclusive visualmente, os meus blocos do prompt para garantir que a IA não confunda partes do objetivo dela com a entrada que você está passando. Se a entrada que você está passando está junto com o objetivo, passa esse teste, você cola teste para cobrir isso aqui. Aí ela misturou o objetivo dela, ela misturou com a função que ela tem que trabalhar e aí as coisas começam a ficar menos sistemáticas, gerando ainda mais ambiguidade. O outro ponto, que é o ponto mais crítico, na minha opinião, sempre, porque muitas vezes a gente sabe o que pedir para IA, mas a gente não sabe definir como a gente quer, principalmente em documentação então você define ali o formato de saída por exemplo, define o formato exato para minimizar riscos de resposta fora de padrão então nesse caso aqui eu forcei um pouco a barra e coloquei responda apenas com um objeto JSON no formato, o test file e o conteúdo do arquivo de teste e daí eu coloquei ali coverage notes e a breve descrição da cobertura que esse teste está fazendo então Wesley, você está pedindo para ela retornar um JSON com o conteúdo do teste dentro do JSON nesse caso eu fiz para garantir que ela vai sair exatamente nesse formato precisa ser assim? você precisa fazer a sua IA trabalhar com o JSON? não apesar que quando você for trabalhar com agentes de IA e esses caras se comunicando JSON ou qualquer formato que tenha uma clareza de regras sempre vai mitigar um monte de problemas, inclusive riscos de segurança. Bom, uma vez que eu defini o formato de saída, eu vou definir agora os critérios de qualidade. Ou seja, eu vou especificar para a IA o que define para mim uma resposta boa dela. Ent quais s esses crit que eu estou passando aqui para ela Crit O teste deve rodar com o NPM teste sem ajustes Ele deve cobrir os casos de entrada v e inv Não usar bibliotecas externas além do Jest. Então aqui eu já falei claramente aqui para ele como são os critérios que eu quero para ele conseguir realmente seguir para ele trabalhar com o que eu preciso. e depois a gente tem algo que é muito importante que normalmente a gente deixa de fazer que é o tratamento de ambiguidades ou assumptions, são pressupostos por exemplo eu digo para a IA fazer caso ela não tenha a informação que eu estou partindo do princípio que ela tem por exemplo, se faltar a versão do Node que você não consiga achar alguma coisa desse tipo assuma que a versão é a versão do Node 18 liste todos os pressupostos feitos no campo assumptions, por que que eu estou dizendo isso? toda vez que a própria IA ela tiver dúvida e que ela teve que assumir algo para ela terminar a tarefa, eu quero que ela fale para mim, no final das contas que ela fez essa tarefa partindo do princípio que o node é 18 que o jest ele vai funcionar dessa forma, que quando ele rodou NPM teste, todos os testes iriam ser corrigidos, e não somente aquele teste que eu estava trabalhando, assim, assim, assado. Então, ela consegue informar para você o que ela assumiu na hora que ela estava atendendo os seus critérios de qualidade. E depois, algo importante também, que são instruções negativas. Ou seja, você lista o que não pode aparecer numa resposta. Por exemplo, não inclua explicações ou comentários fora do JSON. Então, você já está falando, cara, você não vai fazer isso. Porque, às vezes, ela pode fazer, às vezes, ela não pode fazer. Então, você sempre vai colocar claramente o que ela não deve fazer na saída, principalmente. Ou seja, as instruções negativas normalmente são feitas para a saída. Esse é um ponto importante. E aqui é tratamento de erro. então, toda vez que ela acredita que pode ter um erro, ou se ela está fazendo algum tratamento adicional para fazer aquilo funcionar você vai fazer o seguinte olha, não consegui fazer funcionar, deu pau deu errado, ou seja, Iá não conseguiu cumprir a tarefa, você explica para ela como que ela pode retornar se ela não foi possível de cumprir aquilo que ela estava, aquilo que a gente pediu e daí nesse caso, eu posso pedir para ela fazer um JSON status error e a explica do problema do motivo pelo qual ela n conseguiu cumprir aqueles meus crit de qualidade para rodar os meus testes E aqui tem então um exemplo completo de como que ficaria um prompt estruturado. Estou dizendo que esse prompt tem todas as explicações e todos os detalhes do mundo e que é o melhor prompt que você vai colocar e você vai resolver todos os seus testes automatizados? Não estou dizendo Mas o que eu quero que você veja É que há uma estrutura clara Por sessões E que ficam muito mais fáceis Daí a entender E de você também Até mesmo quando você for reaproveitar Esse prompt para outras coisas Então você tem o Persona e Scope Você é um assistente especializado em Node.js Versão 18, teste com o JEST Não faça refatorações no código original O objetivo é gerar tese unitárias Para a função abaixo usando o JEST a entrada está aqui a função o formato de saída responda apenas com o objeto JSON nesse formato critérios, o teste deve rodar com o NPMTS sem ajustes, cobrir os casos não usar bibliotecas, ambiguidade de pressuposto, se faltar a versão do Node assuma a versão 18 e adicione isso em assumptions, instruções negativas inclua as explicações ou comentários fora do JSON, tratamento de erro se der alguma coisa ruim, retorne para mim um JSON com erro e com a explicação por que aquilo não foi trabalhado. Então, se você perceber, galera, tem uma diferença muito grande de você realmente criar um prompt claro, estruturado e intencional para resolver problemas do que você simplesmente vai lá e fala, olha, você copia um pedaço do código, gere o teste desse aqui, baseado em todos esses outros testes que eu tenho nesses arquivos. Cara, a chance de não sair como você quer é grande, a chance de sair fora do padrão é grande as chances às vezes de ela fazer testes que são inúteis pode ser grande, então você sempre pensando numa estrutura independente de qual seja ela, você consegue ser intencional, agora aqui vai uma dica, pessoal porque dá trabalho e leva tempo fazer esses prompts, e eu sei disso porque eu faço um monte desses prompts mas novamente da mesma forma que a gente trata o teste como um ativo no projeto ao longo dos anos, a documentação como um ativo no projeto ao longo dos anos, você vai começar a tratar os seus prompts como um ativo ao longo dos anos. E a parte mais interessante é que os seus prompts vão poder ser reutilizados em diversos e mais em diversos programas e que você não vai mais precisar partir do zero. Fechou? Então é isso aí galera, ficou meio grande esse vídeo, mas eu queria passar aí para você esse tipo de estrutura somente para você ter uma ideia de como que você pode fazer.", "data": "2026-01-13 23:23:35"}, "9": {"origem": "arquivo_local", "titulo": "9-Finalizando com regras de ouro.mp4", "texto": " Então, pessoal, só para a gente concluir o nosso raciocínio do que a gente viu dessa estruturação anterior, notas mentais, eu chamo isso de regras de ouro, quando você vai estruturar qualquer tipo de prompt, são coisas que você tem que pensar e que normalmente tem que ter no seu prompt. Se não tiver, tem que ter uma justificativa muito clara para não ter. Mas, normalmente, você vai ver coisas parecidas com essa. Então, antes de rodar um prompt, revise se ele define persona ou escopo, se ele tem um objetivo direto, se ele fornece entradas separadas e mínimas, se ele define o formato de saída, se ele lista critérios claros do que deve ser feito, se ele trata ambiguidade e erros e se ele inclui proibições necessárias. Uma vez que você tiver isso como nota mental, Eu acredito que você pode criar qualquer tipo de prompt, mas obviamente eles vão ter que ser adaptados. Ou seja, às vezes eu quero criar um prompt que ele vai trabalhar em batch, então as entradas separadas e mínimas não são tão mínimas. O formato de saída, às vezes, não é tão simples como apenas trazer um teste. Entende? Então o ponto principal aqui é que você sempre tem que pensar no conceito. O que eu quero ter de entrada, o que eu quero ter saído, o que pode, o que não pode e como que eu consigo especializar esse meu agente para que ele entenda de cara o contexto que você está trabalhando. Então pense nessas regras de ouro, tome nota, coloque uma notinha. Toda hora que você for criar um prompt, tenta começar por isso. É um bom começo aí para você. Fechou?", "data": "2026-01-13 23:23:37"}}}