{"_default": {"1": {"origem": "arquivo_local", "titulo": "1-Analisando estruturas de prompts.mp4", "texto": " Bom, pessoal, agora que a gente entendeu uma estrutura básica para que a gente consiga criar um prompt de uma forma um pouco mais organizada, eu vou mostrar para você um prompt que eu uso para eu verificar dependências de bibliotecas no meu projeto. Muitas vezes eu quero saber se eu estou usando últimas versões, se eu estou usando bibliotecas depreciadas ou com falhas de segurança e etc. Então, eu utilizo essa mesma estrutura de prompt, mas para fazer essa varredura de dependência dos meus projetos. Agora, eu tenho um ponto bem importante que eu quero falar aqui para você, que é o seguinte, eu estou utilizando essa estrutura para esse tipo de prompt, para verificar a vulnerabilidade, mas eu estou mostrando esse exemplo porque é algo mais mundo real, dia a dia de nós desenvolvedores. Por outro lado, isso não impede que você use essa mesma estrutura em outro contexto que não seja o contexto de desenvolvimento. Por exemplo, imagina que você está integrando uma aplicação de inteligência artificial na sua empresa que você precisa passar instruções claras ali para o agente que você está desenvolvendo. Então, eventualmente, você pode utilizar essa estrutura. E por que eu digo eventualmente? Como eu disse, não é uma única estrutura de prompt que vai resolver todos os problemas da sua vida, da empresa que você trabalha e tudo mais. Mas isso aqui é um bom começo e agora eu vou começar a mostrar na prática para que a gente consiga fazer um depara ali em relação ao que eu criei. Então no próximo vídeo agora aqui a gente vai começar a analisar persona, escopo, objetivo, entrada, saída, critério, ambiguidade, instruções negativas e etc. Vamos nessa!", "data": "2026-01-14 00:20:02"}, "2": {"origem": "arquivo_local", "titulo": "2-Dependency Auditor Agent Prompt.mp4", "texto": " Bom pessoal, como eu falei para vocês no vídeo anterior, vamos agora, vamos dizer assim, colocar um pouco mais a mão na massa e entender esse tipo de estrutura e um prompt mais vida real que você pode sair inclusive utilizando, tá? Então eu vou fazer isso aqui, deixar eu aqui no meu Notion, onde eu tenho esse meu prompt e você vai conseguir inclusive ter acesso a isso aqui que eu criei, tá? Então, seguinte, a nossa ideia aqui é nós termos um agente que faz auditoria de dependências em um projeto. Esse prompt aqui, ele está escrito em inglês, mas de forma geral você vai perceber que nós temos exatamente a estrutura que eu passei para vocês. Então, o que a gente está colocando aqui para que a gente consiga entender em relação a essa estrutura? Primeiro passo, persona e escopo, ou seja, a especialidade que o agente tem, quem é esse agente e no final das contas o escopo, ou seja, até onde ele vai, então qual que é a ideia principal. Então, nesse nosso caso aqui, eu estou falando que ele é um senior software engineer e também esse expert em gerenciamento de dependências, com uma expertise gigante em analisar projetos de software e dependências entre múltiplas linguagens de programação. Agora, o ponto importante que eu estou colocando aqui é, o seu papel é estritamente analisar e fazer um report. Você nunca deve modificar nenhum projeto, ou fazer, inclusive, upgrades ou propostas de upgrades, ou alterar o meu codebase em nenhuma etapa. Então, aqui a gente já passa pela nossa primeira estrutura que a gente acabou falando. Segundo ponto aqui, muito claro, e perceba, pessoal, eu sempre tento ser o mais pontual possível para evitar qualquer tipo de alucinação ou evitar com que a IA tente fazer mais ou menos do que eu pedi. Isso é garantido? Não é garantido. Mas você vai perceber que conforme você testa esses tipos de prompt, você vai perceber que você minimiza bastante esses riscos. Então, qual que é o objetivo dele aqui? Bem claro. Performar, fazer uma auditoria completa de dependências que identifique dependências depreciadas, desatualizadas, bibliotecas que estão em formato de legacy, ou seja, que vão ser descontinuadas, verificar, inclusive, vulnerabilidades no banco de dados de vulnerabilidades conhecido, fazer uma flag de bibliotecas que não estão mais sendo mantidas por mais de um ano, eu coloquei aqui, fazer a verificação das compatibilidades de licenças e riscos legais que eu possa ter, e também aqui fazer um highlight de pontos de falha para manutenção que pode causar um grande problema no projeto, e também prover uma forma estruturada de recomendações sem ter que fazer nenhuma modificação no código. Então, se você perceber aqui, eu estou trazendo qual é o objetivo muito claro aqui do agente. então somente de ler isso até para mim fica mais claro o que eu estou querendo e uma dica que eu já dou aqui para você é o seguinte, fazer esses bullet points que eu acabei de colocar aqui para você, não é fácil por que eu estou dizendo isso? porque normalmente a gente quer pedir as coisas para IA, mas a gente mesmo não tem uma clareza tão grande então o grande problema muitas vezes, dificuldade que a gente tem em construir um prompt, um bom prompt é ter essa clareza. Então, por isso, criar prompts que realmente funcionem também dá trabalho por conta disso. Agora, vamos falar sobre inputs. Lembra que a gente tem entrada e saída e tudo mais? Então, a input aqui é o seguinte. A gente vai passar para ele, no final das contas, arquivos de dependências e arquivos lock, onde tem aquela lista realmente das dependências, como package.json, package.lock, pnp, yarn, requirements.txt, estou passando coisas do Rust aqui, do Go e etc. Então, se você perceber aqui, as inputs podem ser os arquivos de dependência, porque para mim são importantes, porque normalmente projetos têm a lista de dependência nesses arquivos. Outra coisa como input é detectar, nesse caso aqui, a linguagem, framework e as ferramentas do repositório. O que mais que ele tem de input? Instruções opcionais do usuário, como focar em segurança, licenciamento, especificação e ecossistema. E se nenhum arquivo de dependência for detectado, falar explicitamente e pedir explicitamente qual é o caminho para confirmar se ele deve proceder ou não com informações limitadas. Então, se você perceber aqui nesse meu input, a minha input, no final das contas, são os arquivos do meu projeto. Mas eu quis detalhar um pouco mais para quê? Para que ele tenha um foco maior nos arquivos que fazem, que tem normalmente o manifesto das nossas dependências ali de forma geral. muitas vezes o usuário na input ele vai querer passar esse prompt mas às vezes pedir algo adicional então por isso que eu tenho uma parte que é opcional ali em relação baseado às instruções do usuário e tamb se eu n passar informa suficiente ele pode ter a liberdade de perguntar para mim e ver se o suficiente para ele conseguir fazer essa auditoria Agora o ponto aqui est nessa parte de output format Então, aqui é uma outra coisa que é muito complexo, novamente, se você não tem clareza do que você quer. Então, nesse caso aqui, eu estou dando aqui para ele como output o seguinte. retorne um markdown, um report de markdown, nomeado como Dependence Audit Report, com as seguintes sessões. E agora que a coisa traz para a gente uma clareza, por exemplo, de um Tree of Thoughts, que no final das contas eu estou especificando exatamente um esqueleto, Tree of Thoughts, não, Skeleton of Thoughts, um esqueleto claro do que eu quero e como eu quero. Então, summary, o sumário, ou seja, dar uma visão de high level do projeto, as dependências e os principais achados, vamos dizer assim. Trazer também, em segundo ponto, critical issues, ou seja, vulnerabilidade de segurança, bibliotecas depreciadas, legacy e dependências core do sistema. Trazer a lista de uma tabela de dependências para a gente com as versões atuais e os status. Por exemplo, o Express na versão tal, a última versão é tal, então falar que ele está outdated. A Lodash, mesma coisa, a Langchain e etc. Então, se você perceber aqui o que eu estou querendo trazer para ele é, nesse caso, um exemplo. Porque se eu falo, traga uma tabela de dependências e mostrar o que está depreciado ou não, fica muito mais difícil e muito mais ambíguo para que a Yala consiga entender. Então, nesse nosso caso aqui, o que a gente está fazendo? Eu estou trazendo especificamente como eu quero. Mesma coisa, análise de risco. Traga os riscos presentes nessa estrutura. Então, eu estou colocando aqui o nível de criticidade, a dependência que eu estou dizendo, a issue que está registrada no banco de dados e os detalhes do que se trata esse tipo de problema. Ou um outro tipo de nível de risco é nível alto, por exemplo, mangúzio e depreciado. Então aqui estou trazendo exemplos aqui para a gente. Uma outra coisa que pode acontecer é que, caso ele não consiga verificar problemas de dependências, a gente pode colocar uma seção aqui para a gente saber o que ele não conseguiu identificar. Porque daí eu posso buscar uma forma minha de tentar identificar esses casos. Então eu estou colocando aqui uma tabela de dependências que não foi possível verificar completamente, como versão, status ou vulnerabilidade. E aí que está o ponto. Eu coloquei aqui, importante, somente inclua essa seção se existirem dependências sem ser verificadas. Por que eu estou dizendo isso? Porque se eu não coloco uma observação dessa, provavelmente ele vai trazer essa seção escrevendo. Nenhuma dependência não foi conseguida fazer a verificação. Ou seja, então eu estou falando, só coloque isso aí caso ele encontre uma dependência. Beleza? Outro ponto agora aqui, e aí vai mais algumas coisas interessantes. Critical file analysis. Então eu estou colocando assim para ele. identifique e analise os 10 arquivos mais críticos do projeto que tenham riscos de dependências ou ele pode ser depreciado, com vulnerabilidade ou muito antigo, ou qualquer coisa desse tipo e eu coloquei, explique o porquê esse arquivo é crítico qual que é o impacto no negócio, na integração do sistema na dependência, na concentração dessa dependência e eu coloquei aqui também para ele porque às vezes você pode ter um comportamento ambíguo. Isso tinha acontecido quando eu fui testar esse prompt. Eu coloquei agora, always use the relative path to identify the files, porque às vezes ele pegava o caminho completo do meu computador e eu não quero que isso fale. Aconteça, então eu falei para ele usar o meu caminho relativo. Perceba que quanto mais detalhe, melhor. Passo número 7, notas de integração. Fazer um resumo de como cada dependência é usada no projeto. um plano de ação, criar recomendações para os próximos passos sem mostrar os esforços ou o tempo estimado por que eu estou colocando dessa forma? grande parte das inteligências artificiais, quando eu peço para ele fazer um report, uma lista de tarefa ou qualquer coisa desse tipo eles tem uma mania de colocar o seguinte, olha, para resolver esse problema é um dia, ou para resolver esse problema, quatro horas de trabalho, meu, eu não quero nada disso, não tem sentido nenhum ainda mais se eu for resolver esse problema com o IA então eu não sei da onde que ele tira esse tempo, e se eu realmente quisesse colocar esse tempo eu teria que colocar no meu prompt como que ele pode fazer o cálculo desse tempo, nesse caso eu estou explicitando para que ele não coloque esse tipo de coisa e depois o final step é depois de você produzir o report completo o relatório completo, se o usuário não colocou qual é o arquivo e o caminho desse arquivo, eu quero que ele explicitamente pergunte, você quer salvar esse report em algum lugar? Se voc quiser traga aqui para mim o nome o caminho e o nome do arquivo Por qu Porque muitas vezes dependendo da intelig artificial que voc vai usar ele vai gerar esse report na tela Por exemplo se voc tiver com o Cloud Code o Gemini ou alguma coisa desse tipo no CLI, ele vai trazer mais ou menos esse report no seu CLI, e às vezes é muito ruim de ver, e normalmente esse report eu vou querer salvar comigo para eu mostrar para alguém ou para eu tomar alguma decisão. Então, se eu, no momento que eu chamei esse agente, ou utilizei esse prompt, eu não informar qual arquivo que é para ele gerar esse report, eu quero que ele me pergunte. E agora, a gente tem os pontos aqui de critérios. Somente para você lembrar aonde que a gente está. A gente está no output. Se você olhar aqui no nosso documento inicial, a gente tem output, critérios, ambiguidade, instruções negativas, tratamentos de erro. Então, perceba que o nosso prompt, apesar de eu estar falando já faz um tempo aqui a gente ainda está na parte de output então uma vez que acabou essa parte de output a gente vai para critérios e esses critérios aqui são importantes para caramba para conseguir fazer com que esse relatório ele seja gerado de acordo com o que eu estou esperando então quais são os critérios que ele tem que pensar aqui Identificar todos os package managers e os arquivos de dependência. Porque se ele não fizer isso, no final das contas, fica mais difícil. Catalogar as dependências diretas somente. Ou seja, nesse momento, ignorar as dependências transitivas. O que isso significa? Quando você tem uma dependência que depende de outra dependência que depende de outra dependência. Então, quando isso acontecer, eu estou pedindo para ele ignorar. Porque senão a gente vai entrar numa árvore gigante de dependências, Não que isso não seja importante, é, mas nesse report eu só quero saber minhas dependências diretas. E daí eu coloquei aqui, compare cada dependência contra a última versão estável dessa dependência apenas para reportar. Por que normalmente eu estou reforçando dessa forma para garantir que ele não vai nem tentar fazer um upgrade? Faça um flag de dependências que estão depreciadas. considere pacotes que não estão sendo mantidos por mais de um ano verifique as vulnerabilidades que estão no banco de dados de vulnerabilidades verifique a licença categorize os riscos por critical, high, medium e low eu imagino que você deva ter visto naquela tabela e talvez tenha pensado opa, mas ele não especificou quais são os tipos de criticidade então aqui eu estou colocando os critérios para na hora que ele gerar a tabela, eu escolher como ele está querendo trabalhar. Outra coisa, identifique os pontos de falha, os single points of failures, ou seja, dependências que geram impacto em múltiplas features do meu software. Coloquei aqui, faça um highlight e breaking changes que foram introduzidas nessas novas versões. Verifique a manutenção e o esforço de manutenção para manter essas dependências atualizadas. Quando estiver disponível, utilize MCP servers como um Context 7 ou um Firecrawl para validar as versões, as manutenções e as vulnerabilidades. Por quê? Porque esses MCPs têm acesso a documentações, como o Context 7, e o Firecrawl, no final das contas, ele consegue fazer ali uma varredura, uma leitura das páginas de uma forma muito mais completa do que alguns outros caras que fazem web scrape, no final das contas. Mas você não é obrigado a usar o Firecrawl, e somente se, por exemplo, o seu MCP estiver ativo. Mas perceba, eu estou falando para ele usar MCP Servers, e eu dei exemplos de MCP servers, mas eu não estou falando necessariamente quais ele tem que usar. Por quê? Eu posso ter algum outro MCP server que possa fazer a mesma coisa que um Contact 7 da vida ou um Firecrawl aqui para a gente. Outra coisa, sempre traga para mim o número das versões, as identificações aqui de banco de dados e também uma versão aqui completa dos próximos passos. focando sempre em sites mais claros do que você dar conselhos mais genéricos. E se você não conseguir acessar pacotes externos, registros, MCP servers, bancos de dados e vulnerabilidades, mostre claramente essa limitação e trabalhe apenas com a informação que você tem nos arquivos de projeto. Então, eu quero que isso fique muito claro mas que ele mostre para a gente que ele tem essa limitação. Então, aqui a gente está na parte de critérios. Então, são critérios que eu quero que ele use para ele conseguir gerar o report naquele formato que é o output que a gente passou. E aqui a gente tem ambiguidades e pressupostos, assumptions. Então, eu vou dar um exemplo aqui para que ele parta do princípio para evitar confusões. Então, por exemplo, se eu encontrar múltiplos ecossistemas que estão presentes, faça o audit dele separado e fale isso explicitamente no resumo. Como assim? Imagina que eu estou em um projeto que está trabalhando com Python e um outro projeto que está trabalhando com Go e eles estão na mesma pasta onde eu estou rodando o agente. Ent ele tem que perceber que ele est em projetos diferentes ou eventualmente um projeto back ou um projeto front Outra coisa se tiver registros externos bancos de dados ali onde você pode, por exemplo, encontrar vulnerabilidades. Ah, e toda hora eu estou falando de banco de dados de vulnerabilidade, estou falando de CVE, somente para você saber e deixar claro, para evitar dar mais clareza para vocês. CVE significa Common Vulnerability Exposures. Então, basicamente, são exposições de vulnerabilidades que são conhecidas e cada uma dessas vulnerabilidades vem com um tipo de um código, onde vai falando qual é a vulnerabilidade, o código permite que a empresa e as ferramentas de segurança fiquem sabendo e utilizem um ID único para cada vulnerabilidade, somente para deixar claro aqui para vocês. Outra coisa, se alguma versão estiver faltando aqui, documente e coloque ali o seu nível de confiança em relação a isso. Se estiver faltando lockfiles, ou seja, aquele arquivo que trava a versão que você está trabalhando no projeto, fale que você não tem, que o seu risco é maior para você reproduzir isso quando for para a produção. Aqui, se o usuário não especificar a pasta que ele quer auditar, faça o audit no projeto inteiro. Se não, faça somente na pasta que ele pediu. E por que eu estou dizendo isso? Porque às vezes eu tenho várias pastas no meu projeto e eu quero validar somente um projeto, às vezes eu estou num monorepo, às vezes eu quero auditar uma feature ou alguma coisa desse tipo. E agora a gente entra naquela outra parte, que é instruções negativas. Então aqui, não modifique ou sugira edição no codebase. Não rode nenhum comando de upgrade. Não crie nenhum CVI ou assuma vulnerabilidades. vai que a IA alucina e ela inventa um código como se isso fosse uma vulnerabilidade comum. Não use frases vagas como provavelmente seguro ou isso aqui deve estar ok. Não use emojis ou caracteres estilizados. Galera, se tem algo que me irrita particularmente é a utilização de emojis em relatórios e coisas desse tipo. Então eu sempre tento forçar para que ela não utilize. E eu vou ser honesto com você, que às vezes, mesmo assim, a IA acaba colocando, mas eu tento minimizar para caramba isso. Outra coisa, novamente, instruções negativas, e vale sempre apenas reforçar, não dê estimativa de tempo para resolver, como dias, horas, duração, ou em tantas horas, para fazer a resolução de fix e upgrade, para correção e fazer upgrade. Agora aqui a gente tem a parte de erro. E a parte de erro aqui eu estou colocando. Se ele não conseguir fazer auditoria, como não encontrou arquivos de dependência ou não conseguiu acessar os arquivos ou qualquer coisa desse tipo, responda no seguinte formato. Status erro, razão. Nenhum arquivo de dependência encontrado. Dê uma instrução clara aonde e porquê isso aqui não foi performado. Isso gira também próximos passos. Por exemplo, dê o caminho onde estão as dependências, os arquivos de manifesto. Dê permissão à Workspace para ele poder ter leitura desses arquivos. Confirme qual ecossistema você está utilizando ou está querendo auditar. Então, aqui são formas que ele pode trazer de erro caso ele não consiga realmente fazer a tarefa. A não ser que, provavelmente, esses tipos de erro podem acontecer se você tiver alguma falha de, como se diz, permissão que a IA vai ter para ler os seus arquivos ou alguma coisa desse tipo. E aqui, por último, pessoal, eu gosto às vezes de reforçar quando eu quero ter um passo a passo do que a IA vai fazer. Apesar de eu ter passado passo a passo do que eu coloquei lá em cima, aqui eu estou fazendo um resumo, ou seja, o workflow que ele vai trabalhar. Então, novamente, detectar o projeto, a TechStack, os Package Manager, fazer um inventário das dependências, comparar e declarar as versões, fazer o flag, detectar vulnerabilidades, verificar a compatibilidade de licença, categorizar, identificar os arquivos, performar e etc. Então, basicamente, aqui é o workflow que eu estou dando passo a passo aqui para ele. Quando eu escrevo o workflow, para ele fica muito mais simples entender esse meu passo a passo de uma forma resumida. Então, normalmente, eu costumo fazer assim e até mesmo para eu ler fica um pouco mais claro. Então, se você perceber, esse é um prompt, não estou dizendo que é o melhor prompt possível e também não quero dizer que esse prompt vai funcionar 100% da melhor forma possível, porque provavelmente os resultados que esse prompt vai trazer usando uma IA num determinado tipo de codebase ou uma IA com outro modelo ou coisas desse tipo, novamente a gente está falando sobre probabilidade. Mas um prompt desse, com certeza, ele já consegue trazer algo um pouco mais estruturado. Eu sei que esse vídeo ficou grande, mas no próximo vídeo eu vou trazer para você como que é o resultado desse prompt que ele trouxe aqui para mim. Então vamos nessa.", "data": "2026-01-14 00:20:14"}, "3": {"origem": "arquivo_local", "titulo": "3-Resultado gerado pelo prompt.mp4", "texto": " Bom, pessoal, no vídeo anterior, a gente ficou explicando e falando sobre o prompt e aquela estrutura que a gente seguiu. Agora, o negócio aqui é o seguinte. Aqui é um exemplo de um resultado de quando eu rodei esse prompt dentro de um codebase que eu tinha aqui comigo. Somente a gente vai olhar isso aqui, somente para você ter uma ideia de como ele gerou. Mas depois, em seguida, o que eu vou fazer? Eu vou mostrar para você um prompt bem pequeno de um comando do Cloud Code. E lembrando, pessoal, talvez na hora que você esteja vendo esse vídeo, o Cloud Code tenha mudado o formato de trabalho, ou talvez ele esteja de uma forma diferente ou qualquer coisa desse tipo. Mas a ideia principal aqui não é focar na ferramenta Cloud Code ou no Gemini, ou nas ferramentas do Codex da OpenAI ou qualquer coisa desse tipo. mas sim pensar em como que o prompt pode afetar, beleza? Então, aqui é um resultado daquele report. Você deve também estar se perguntando, Wesley, por que você fez aquele report inteiramente em inglês? Normalmente, a IA tende a trazer resultado um pouco melhor, ou às vezes, dependendo da situação, bem melhor em inglês, porque ela tem mais treinamento em inglês. Por outro lado, eu vou deixar isso bem claro para você, no meu dia a dia, por muitas e muitas vezes, quando eu vou criar um prompt, normalmente eu faço esse prompt em português e na maioria das vezes isso funciona, eu escrevo muito mais rápido, meu português é muito melhor para eu escrever do que o meu inglês e tudo mais. o que eu também faço dependendo de como eu vou distribuir ou caso eu queira emprestar ou dar esse prompt para alguém ou na empresa que essa pessoa trabalha e eles trabalham s com ingl eu simplesmente vou e traduzo usando o pr IA o meu prompt de portugu para ingl e obviamente a voc tem que passar um pente fino para evitar qualquer mal entendido até mesmo nesses tipos de tradução. Então por isso que você está vendo todos esses resultados que a gente colocou em inglês. Uma outra coisa que a gente pode fazer é, no final do prompt, falar para ele gerar o relatório completamente em português. talvez seja uma outra solução aqui também para a gente. A gente pode até testar isso depois. Então, basicamente, eu vou mostrar aqui o report que ele gerou nesse Codebase. Então, ele trouxe aqui dependency audit report, aqui o sumário, ou seja, o resumo. Eu poderia colocar para ele colocar a data que eu gerei aqui também, logo lá nas instruções. E aqui ele está falando que eu tenho um projeto de agentes baseado em Python, criado em cima do Google ADK, que implementa a verificação de bugs e criar issues no GitHub, no formato de uma pipeline. Esse projeto tem 11 dependências diretas, espalhadas num requirements.txt, com no lock files present, ou seja, eu não tenho um arquivo ali locado do requirements.txt. Enquanto as dependências, elas geralmente são bem mantidas, a gente tem algumas vulnerabilidades de segurança e versões que foram identificadas. Então, aqui ele trouxe para mim aqui key findings, ou seja, aqueles encontros, aqueles achados que ele acabou de fazer. Então, ele colocou aqui uma vulnerabilidade crítica de segurança e ele trouxe aqui baseado no Light LLM. Light LLM é um pacote que você usa para você utilizar qualquer modelo de inteligência artificial, independente se você está rodando com ADK, por exemplo. ele achou seis depend cr de vulnerabilidade uma depend que pode estar escrito um problema de type ou seja ela foi escrita de forma errada ou ela n est sendo utilizada no projeto não encontrou nenhum lockfile que pode gerar problemas na hora que eu for colocar em produção, porque os lockfiles são aqueles caras que realmente garantem qual é a versão exata que está sendo utilizada e tudo mais, tipo um package .lock, quando a gente está trabalhando, e versões misturadas de especificações de padrões, algumas pinadas ou não pinadas. Ah, e só para ficar mais claro, o que é pinado e não pinado? Quando eu estou falando que uma, quando eu tenho uma dependência pin, significa que essa dependência tem a versão exata de qual ela está sendo utilizada. Ou seja, se houver alguma nova versão dessas dependências, não é feito o upgrade, porque você tem exatamente a versão, tipo 1.0.2. Mas aqui também eu tenho dependências que eu não tenho isso. Então, só está o nome da dependência. Significa que se em algum momento houver uma atualização, isso vai ser feito e talvez possa quebrar o meu software. Então, isso é importante. E aqui ele trouxe os critical issues do que está acontecendo e principalmente no Lite LLM, que ele tinha falado bastante, achou no Paident, que também, no Pendas, ele trouxe dependências depreciadas, aqui onde ele achou, e ele falou aqui, pode ter um problema de typo ou você tem que verificar o nome do pacote para ver se realmente está certo. Daí ele trouxe aqui a lista de dependências que eu tenho e quais são as dependências que estão desatualizadas e coisas desse tipo. A ele trouxe para mim uma an de risco falando o que pode acontecer com essas depend aqui para mim depend sem ser verificadas ele repetiu aqui por conta daquela que pode estar algum erro e aqui ele come a trazer aqui para mim os arquivos que tem mais criticidade em relação às dependências. Então ele trouxe aqui o agent.py, ou seja, basicamente ele pegou todos os arquivos principais de agentes que estão utilizando pontos do Google ADK, o Python.env, ou seja, ele pegou os arquivos mais críticos que são afetados por essas dependências aqui. E ele fala o porquê, porque eles usam isso como o core do workflow do meu agente, ele usa a informação sensitiva, sensível, porque ele cria uma issue no GitHub, tem acesso ao Discord, ele tem vulnerabilidades de autenticação e configuração, ele também acessa a logs externos que possam conter conteúdos maliciosos. E aí ele traz aqui o integration notes, falando o que eu estou utilizando e os principais pacotes aqui para mim, e o meu plano de ação aqui imediato que eu devo ter para tentar resolver esse meu problema. Ou seja, resolver o nome daquele pacote, fazer o update do Lite LLM, atualizar o Pident, atualizar o Pandas, colocar um lock file, forçar as versões, verificar as minhas variáveis de ambiente, o .env, para evitar. e aqui ele trouxe um monte de coisa aqui para eu fazer. Então, no final das contas, pessoal, esse foi o resultado do relatório que eu consegui baseado naquele prompt que a gente acabou colocando e trabalhando. Próximo vídeo eu vou mostrar isso aqui na prática para vocês e vou mostrar também como que eu fiz para invocar esse relatório, ou seja, esse tipo de dependência aqui para a gente. Beleza? Então, vamos nessa.", "data": "2026-01-14 00:20:19"}, "4": {"origem": "arquivo_local", "titulo": "4-Arquivo declarativo do Agent e Prompt como Metadados.mp4", "texto": " Bom, pessoal, seguinte, estou aqui com a minha ideia aberta. Esse aqui é o projeto que tem um monte de dependência desatualizada, faz um bom tempo que eu criei, é um projeto exemplo que eu faço, então não é nada que esteja em produção, mas é legal pegar esses projetos principalmente porque passa tempos e ele começa a utilizar versões antigas e coisas desse tipo. Aqui que você está vendo é o report que ele acabou gerando, que eu mostrei para vocês no nosso último vídeo. Agora, o que acontece aqui que é interessante é o seguinte, na hora de rodar eu pedi para ele gerar um nome do arquivo aqui como LibReport, agora tem algo importante aqui para você entender. O negócio é o seguinte, apesar disso ser um prompt, ou seja, aquele prompt que eu acabei de mostrar para você, eu resolvi nesse caso, e aqui a gente está falando de ferramenta, a gente está falando de prompt, mas em ferramenta que utilize esse prompt. Não necessariamente, dependendo de quando você está assistindo esse vídeo, essa ferramenta, por exemplo, do Cloud CLI, ela vai estar exatamente nesse padrão que dê para você utilizar exatamente dessa forma. Mas o importante é você entender a ideia de como a gente está trabalhando em relação ao prompt. Por que eu estou dizendo isso? Porque quando eu clico aqui, run cloud code, ou seja, eu tenho o cloud code instalado aqui no meu computador, o que acontece aqui? Ele tem um recurso chamado de agents ou de agentes. E você pode criar novos agentes com esse recurso. Então, se eu colocar aqui, barra agents, ele pode trazer aqui para mim para eu criar um novo agente ou eu tenho outros agentes que eu já tenho aqui na minha máquina. Então, se eu dou um criar novo agente, ele vai criar, ele vai passar um passo a passo, você depois pode brincar em relação a isso. Mas o porquê que eu estou falando desse cara de como criar agente? Porque é o seguinte, o Cloud Code é um agente de codificação, certo? Ou seja, ele é um cara que faz o que a gente manda baseado no prompt que a gente acaba colocando aqui. A grande quest em rela a isso ao Cloud Code que ele tem esse recurso de agentes que faz com que de acordo com o que voc pe na hora que voc est desenvolvendo ele vai olhar a lista de agentes que ele tem e baseado nessa lista, ele pode chamar um agente especialista em algo para fazer isso ou fazer aquilo. Então, por isso que eu deixo esse meu prompt feito no formato de subagente, porque toda hora que eu peço para ele fazer uma verificação, alguma auditoria, eu sei que ele vai chamar esse agente, e esse agente vai gerar o report exatamente da forma como eu estou querendo. Mas tem algo interessante aqui que eu preciso mostrar para você, mas que o próprio Cloud Code gerou e eu apenas complementei com algumas coisas. A legibilidade é um pouco ruim, mas eu vou mostrar aqui para vocês. Eu tenho uma pasta aqui chamada .cloud, dentro da pasta .cloud eu tenho uma pasta Agents, e se você olhar aqui, eu tenho um agente de auditoria, um auditor agent. E nesse cara aqui, deixa eu esconder, deixa eu aumentar a minha fonte. Se você olhar aqui, vou tentar deixar o maior aqui possível para você ver. Ele tem aqui três tracinhos que ele utiliza como metadado. E o que ele coloca nesse metadado? O nome do agente, então é dependency auditor. e aqui ele traz uma description do agente aqui para mim. Ou seja, use-se agente quando você precisa analisar ou auditar a saúde, a segurança, o status das dependências de um software e tudo mais. Grande parte dessa descrição ele criou na hora que eu falei de acordo com o que eu queria, os objetivos do agente naquele assistente dele. Então, eu simplesmente dei algumas modificadas, mas aqui tem alguns pontos que eu só queria confirmar e dar essa ciência para você. Tem muito mais a ver com o cloud do que necessariamente prompt em si, óbvio que tem prompt no meio, mas somente para você entender como que esse agente sabe que ele vai ser invocado. Então, ele dá exemplos aqui de quando esse agente tem que ser utilizado. E uma coisa interessante é, normalmente, Antropic, que é a que cria o cloud e coisas e essas ferramentas, ela usa muito o XML. Então, se você olhar aqui, olha os exemplos como ela trouxe para deixar mais claro como que fica mais simples da IA entender Ent ele trouxe aqui Exemplos entre n XML, onde ele traz o contexto. Legal? Então, perceba, ele tem aqui, ó. Vou até pular a linha. Contexto. Eu vou colocar um tracinho só para a gente ver melhor. Depois, ele traz user aqui para mim. Legal? Depois que ele trouxe isso, ele traz assistant. Beleza? e depois do assistant, aqui que ele colocou aqui para mim, ele coloca aqui dentro ainda comentário, legal? E depois disso, ele fecha o exemplo dele começando um outro cara. Por que ele está trabalhando desse tipo? Porque aqui, nesse caso, a ideia do prompt dele, e novamente é tudo uma questão de prompt, aqui é uma forma de como ele estruturou esse prompt. Então ele fala o seguinte, olha, já que isso aqui é um agente e ele vai ser usado para isso, como que pode ser algum exemplo de alguma chamada que faça com que esse agente seja chamado? Então ele traz um contexto. O usuário quer entender o estado atual das dependências do projeto dele antes de um major release. ou seja, antes ele botar algo grande em produção. Esse é um contexto. E daí ele tem aqui o usuário falando assim para ele, você pode verificar as nossas dependências, se elas estão atualizadas e seguras? E aí o assistente vai falar o que para ele? Ah, eu vou usar o dependency auditor agent para analisar as dependências do projeto e prover uma forma compreensiva de um repositório, de um report, um relatório de auditoria. Então, aqui ele está simulando como poderia ser a conversa da IA com o usuário e o contexto. E aqui ele coloca, entre XML novamente, um comentário. Olha só que interessante. Desde que o usuário esteja perguntando sobre análise de dependências, Use o dependency auditor agent para revisar a saúde dos pacotes, segurança e etc. Ou seja aqui ele est simplesmente confirmando ou gerando Pelo fato disso aqui est acontecendo voc vai fazer isso aqui Basicamente é isso. Então, ele traz o tempo inteiro um monte de exemplos desse tipo para que isso seja usado como trigger, no final das contas, quando o agente precisar, como o agente sentir que ele tem que ser chamado. Ou seja, a IA vai ter um agente como se ele fosse uma espécie de uma ferramenta, e uma vez que ele tem ali uma espécie de uma ferramenta ali com ele, ele vai saber em qual momento esse agente vai ser útil. E por isso, esses exemplos aqui são tão importantes para que o Cloud saiba quando chamar esse nosso agente que a gente criou. Então, nesse caso, se você estiver utilizando o Cloud para criar algum agente ou qualquer coisa similar e você precisar desses exemplos e você estiver fazendo uma chamada e mesmo assim ele não está ativando a gente, tente verificar como você fez essa chamada e coloque essa chamada como um exemplo para isso poder te ajudar. Então, embaixo disso, ele coloca como metadados o modelo que eu quero usar E a cor que vai aparecer ali no modelo e acabou os meus metadados aqui no final das contas. Agora, olha só que interessante. Embaixo disso é tudo que eu já tinha te mostrado antes. Inputs, outputs, foi o que eu mostrei naquele documento no vídeo anterior. Então aqui tem todo o nosso workflow e aqui tem todo esse prompt que a gente colocou. lembrando que mesmo utilizando esses metadados e toda essa parte aqui do cloud, perceba ainda que ele tem uma estrutura de prompt aqui para a gente. Então, é importantíssimo você conseguir entender que até mesmo com metadados, a gente tem esses conceitos de prompt. Beleza? Próximo vídeo, eu vou trazer algo bem simples para você de como você fazer um trigger direto desse agente usando um prompt simples, mas também para evitar redundância e também evitar que ele faça coisa que não deveria fazer. Então, vamos ver isso no nosso próximo vídeo.", "data": "2026-01-14 00:20:24"}, "5": {"origem": "arquivo_local", "titulo": "5-Executando Agente na prática.mp4", "texto": " Bom, pessoal, no vídeo anterior a gente mostrou, eu mostrei aqui para você o prompt utilizando um agente do Cloud Code. Novamente, eu quero reforçar, você não precisa usar o Cloud Code, você não precisa ter o Cloud Code no seu computador para acompanhar esse módulo. O que eu apenas estou querendo fazer aqui é trazer um pouco mais de prática para a gente apenas não ficar vendo o texto e vendo como que isso pode ser aplicado. Você pode testar isso em qualquer outra IDE ou qualquer coisa desse tipo. Agora, especificamente agora, eu quero mostrar um recurso que o Cloud Code tem onde a gente consegue fazer uma chamada direta para aquele agente. E por que eu estou fazendo isso? Para te ensinar a trabalhar com o Cloud? Não, mas para mostrar qual é o prompt que eu utilizei para que ele não faça nada a mais e a menos do que teria sido combinado. Porque é muito fácil quando você tem um prompt que compõe outro prompt, as coisas começarem a se misturar e dar ruim. Então, vamos lá. Eu vou aqui na minha pasta .cloud. E aqui eu tenho os meus agentes, onde a gente já viu aqui o nosso dependency auditor aqui para a gente. Agora, olha só que interessante. Eu tenho uma pasta chamada commands. Essa pasta chamada aqui commands, o que ela significa? que quando eu for executar o Cloud Code, eu posso dar um barra e chamar um comando diretamente. E esse comando que eu chamo não é um arquivo executável. Ele é um markdown. Então, o markdown é o novo arquivo executável que a gente tem, vamos dizer assim. Deixa eu abrir esse arquivo aqui para que você consiga ter um pouco mais de clareza do que eu acabei escrevendo. E você vai perceber que alguns pontos aqui até acabam sendo redundantes. mas é importante que você entenda o que eu acabei de colocar. Então, é o seguinte aqui. Aqui é um comando, e esse comando eu falei o seguinte, running dependency audit, ou seja, rodar, fazer a execução de uma auditoria de dependência. E aqui eu já passei instruções claras, específicas aqui. Use o dependency auditor agent para rodar a auditoria de dependência no projeto. E aqui, olha só que interessante. Eu coloquei project folder to audit. E aqui eu coloquei isso num formato de uma variável. Poderia ser entre placeholders também, depende muito de como você vai trabalhar, mas normalmente no Cloud Code você trabalha aqui como um dólar de uma variável. Por que eu estou dizendo isso? Porque uma das inputs do usuário tem que ser em qual pasta que você quer rodar a auditoria. E também nós demos um detalhe, que se a gente não passar, é para ele fazer a auditoria da raiz, do projeto inteiro. Então, se você colocar aqui, eu coloquei Project Folder. Aqui, se o usuário não provê a pasta para auditar, rode a auditoria no projeto inteiro. Se não, faça a auditoria somente na pasta que foi provida para o usuário. Uma coisa que eu não sei se você percebeu, mas quando a gente às vezes escreve tanto em português quanto em inglês, a gente tenta evitar ficar repetindo para... Textualmente, quando a gente lê, não parece que eu estou falando coisa redundante o tempo inteiro. agora se você perceber quando a gente está trabalhando com o prompt com o IA quanto mais claro voc for melhor para que ela entenda ent muitas vezes eu n me importo de escrever at de uma forma redundante Por exemplo, se o usuário não proveu o folder do projeto para auditar, faça auditoria no projeto inteiro. Caso, faça auditoria somente na pasta provida pelo usuário. Se eu fosse escrever isso de uma forma, vamos dizer, mais direta, eu não ficaria repetindo a Project Folder to Audit, então faço aqui o Audit no projeto. Então, daria para eu usar a palavra Project somente uma única vez. Eu cliquei aqui e ele acabou abrindo. Eu poderia utilizar somente uma vez, mas no final das contas, eu estou sendo sempre o mais repetitivo possível aqui para mim. outra coisa aqui, que nessa parte de comando é específico, e por isso que eu estou dizendo para vocês, galera, que não tem um único prompt que resolva toda a sua vida. Esse prompt que eu estou colocando aqui, ele é um prompt de comando, ou seja, ele é um prompt que vai acionar um agente que tem o seu próprio prompt. Então eu tenho que evitar a ambiguidade para fazer com que ele não misture os dois prompts e fazer somente o que está escrito nesse comando. Então, uma das coisas que eu quis deixar claro aqui é siga a especificação do agente. E agora tem uma palavra-chave que eu gostaria que você prestasse muito atenção. Muitas inteligências artificiais têm níveis de pensamento. Ou seja, qual é o esforço que ela vai fazer para gerar uma linha estruturada de pensamento para resolver. Então se você fizer com OpenAI Se você coloca Think hard Ou seja, pense forte mesmo E etc Você pode ter resultados diferentes Não é que eu posso ter Eu tenho Porque a LLM é treinada especificamente para isso No caso do Cloud Ele tem uma palavra-chave Que se você utilizar Ele realmente vai fazer um esforço maior Para ler o que você está trazendo Então, nesse caso aqui, é o ultra-think. Então, quando você coloca para ele ultra-think alguma coisa, é porque realmente ele vai gerar uma cadeia de pensamento muito mais forte para conseguir entender tudo. Então, eu falei assim, pense, faça um ultra-think de cada passo da especificação do agente no dependencyauditor.md. Por que eu estou falando isso? para ele não misturar a especificação que eu estou dando aqui para ele nesses comandos com a especificação do agente. E eu digo isso porque eu já tentei fazer sem ser dessa forma e ele começou a misturar as coisas. Então, eu falei, olha, pense realmente em cada etapa. E lembra que a gente tem ali o nosso workflow naquele prompt? Ou seja, o workflow mostra cada etapa e isso ajuda já o nosso agente também a executar. E depois que você entendeu cada especificação, você vai rodar realmente a auditoria do projeto estritamente seguindo as instruções definidas pelo agente de auditoria aqui para a gente. Então perceba o quão repetitivo que eu sou, nesse caso, para ele realmente seguir essas especificações. E aqui eu já coloquei do not forget. Uma coisa importante para você entender, muitos LLMs entendem claramente quando voc usa letra mai quando voc usa negrito quando voc usa exclama ele realmente entende o tom daquilo que voc est querendo colocar Ent voc pode usar sim desse artif Então nesse caso aqui eu tenho do not forget, ou seja, não esqueça. Depois de produzir o report e se o usuário não proveu o arquivo e o nome do arquivo ainda, explicitamente pergunte se ele quer que salve o report, etc. Por quê? Porque esse cara aqui é um comando que vai chamar um outro agente, que vai chamar a especificação daquele agente nosso. Aquele agente pede para explicitamente fazer isso, mas caso aquele agente não peça, porque depois que ele terminar aquela ação, esse prompt continuar rodando, a gente tem uma chance de não ser pedido em qual arquivo ele deve gerar o report. Então, eu coloquei um do not forget, ou seja, eu reforcei algo que já está naquele outro prompt. Outra coisa que eu reforcei é, aqui nesse caso, eu copiei e colei as instruções negativas para garantir que ele não faça essas instruções negativas e estão naquele prompt. Então aqui, pessoal, se você olhar, ele realmente é um prompt de comando que vai fazer com que um outro prompt seja chamado. Então se você olhar aqui, a estrutura dele acaba sendo diferente e a estrutura dele aqui acaba sendo muito mais reforçar o que o outro prompt tem aqui para trazer. E se eu quiser fazer uma auditoria ou quiser rodar, somente para não dizer que eu não estou mostrando nada aqui na prática para você, eu poderia repetir esse processo, abrindo aqui meu Cloud Code, e no meu Cloud Code aqui, deixa eu tentar diminuir um pouco a minha fonte, para a gente tentar fazer o nosso teste. Então, eu vou pedir para ele rodar novamente esse relatório, eu vou remover esse cara daqui, de qualquer forma, porque eu já tinha, E agora, se você olhar o que eu vou fazer, eu vou dar um barra. E nesse barra aqui tem o nome do comando que eu quero executar, que é exatamente o nome do arquivo que eu criei como comando aqui para mim. Então, quando eu falar que eu quero executar esse comando aqui, opa, falei daqui, nesse momento eu posso fazer o quê? passar a variável da onde que eu quero que o meu projeto ele seja auditado. E aí, nesse meu caso, o que eu posso fazer? Eu posso passar, por exemplo, um arroba agents aqui para mim, ou eu posso passar, sei lá, o repositório do Google ADK em Python, que eu tinha clonado o repositório dele aqui. Vou dar um enter e a partir de agora ele vai começar esse meu processo de auditoria com aquele meu prompt. para esse arquivo ele não ficar para esse vídeo ele não ficar extremamente grande, eu vou dar um pause em alguns momentos somente para a gente anotar o que ele tem feito aqui para a gente então aqui somente para a gente entender a linha de pensamento, olha só o usuário está pedindo para rodar uma auditoria de um projeto usando um agente de um auditor então deixe-me breakdown deixa eu separar o que eu preciso fazer usar o agente para fazer auditoria no projeto e na folder tal, seguir as instruções específicas do agente e, depois de produzir isso, perguntar se o usuário quer salvar isso em um arquivo. Ent primeiro eu preciso criar uma to list para traquear as minhas tasks e eu vou olhar a estrutura para eu conseguir ver Pelo jeito um projeto em Python para a gente trabalhar e o projeto parece ser o Google ADK, o Agent Development Kit da Google aqui para Python. Então, deixa eu começar a criar minha to-do list e aqui ele começou a criar a to-do list dele. Então, ele começa a pensar aqui para mim e agora ele demora um pouquinho e ele fala, agora eu preciso iniciar o meu agente que vai analisar esse nosso projeto, então eu vou dar os detalhes das descrições do agente para performar aqui a minha auditoria. E agora aqui, se você ver, ele começou a chamar o agente, ele está laranjinho aqui para mim, ele está falando o que ele está fazendo e agora uma coisa interessante se você perceber, olha o que ele estava usando aqui para ele, o Firecrawl, que era um MCP para ele conseguir navegar nas páginas. Então ele estava fazendo isso. Aí provavelmente estourou os tokens, ou ele não conseguiu ler, ele foi para uma outra tool dele, que é o WebSearch, para ele conseguir fazer a verificação no banco de dados de vulnerabilidades comuns aqui. E aqui ele vai ficar pensando e tudo mais. E finalmente, então, ele rodou tudo aqui. Então, a gente tem, ele rodou, viu as partes críticas, as dependências diretas, fez o relatório estruturado e agora ele falou que ele precisa marcar as tarefas dele como feitas. E ele falou, opa, perfeito, eu completei tudo mais, fiz aquilo e etc. e tudo mais. e agora, olha só que interessante, agora ele trouxe um resumo do que ele fez no relatório, porque até então aqui provavelmente ele estava seguindo ainda aquele passo a passo, mas o parte mais importante que eu vejo é, você quer que eu salve esse report em algum arquivo? Se você quer salvar, coloque o nome do arquivo, e eu vou colocar assim, report-adk.md, e vamos ver como é que ele gera aquele relatório e para ver se esse relatório vai sair no padrão que a gente pediu realmente ali para ele. Prontinho, ele pediu se ele pode editar o arquivo, eu vou falar que sim. E aqui eu vou agora abrir o report do ADK que ele gerou aqui para a gente. Vamos lá, vou fechar. Vou abrir aqui. e agora ele trouxe basicamente aquele mesmo template trabalhando. Então, o sumário dele está trabalhando com o Google ADK, em Python e etc. Tem 25 dependências diretas, os pontos principais, o ecossistema principal, as vulnerabilidades críticas aqui em relação ao pacote, que é o Fast API. E aqui ele trouxe todas as dependências, todas que estão ok, todas que não estão ok, que cada uma faz, é bastante biblioteca, análise de risco, arquivos críticos que ele encontrou aqui, que estão utilizando aquelas dependências, notas de integração, como ele está usando cada ponto para integração, e plano de ação de pontos críticos que ele tem que acabar trabalhando. Pessoal, então, se você olhar de forma geral, isso é uma forma de você conseguir trabalhar com prompt e consegue gerar uma auditoria e nesse caso nós temos os casos de prompt sobre prompt e foi o que acabou acontecendo aqui com a gente do cloud beleza? espero que você tenha gostado e vamos seguir aí", "data": "2026-01-14 00:20:31"}, "6": {"origem": "arquivo_local", "titulo": "6-Estruturas especificas de prompts.mp4", "texto": " Bom, pessoal, e agora a gente vai começar a falar especificamente também de alguns tipos de prompts que vão te ajudar a amarrar as pontas quando você precisa que agentes executem tarefas, tanto de formas sequenciais quanto de formas paralelas. Nós vamos falar aqui especificamente de dois tipos de prompts e eu vou explicar para vocês, inclusive na prática, como que é o comportamento desses tipos de prompts quando eles trabalham, vamos dizer assim, em conjunto. Então o negócio é o seguinte, nós temos um tipo de prompt que normalmente eu gosto de chamá-lo de Workflow Specification Prompt. Basicamente, o que esse prompt faz, ele nos traz comandos específicos do que deve acontecer quando você executa um agente. Mas o grande passo aqui nesse caso que ele pensa exatamente em um workflow ou seja apesar dele ser algo mais procedural vamos dizer assim onde ele segue step by steps ele tem no final do dia tamb templates claros que você quer que sejam gerados a partir desse comando, quando todos os agentes que, por exemplo, podem depender dele, acabam de ser executados. Então, esse é um tipo de prompt e eu vou mostrar para vocês onde esse camarada pode ser inserido. Nós temos também uma outra opção de prompt, que é chamada de role specification. Normalmente eu gosto de chamar ele desse nome. Por quê? Porque esse camarada tem um papel extremamente específico, com responsabilidade score dele, mas ele também tem um framework, ou seja, uma espécie de workflow do que ele deve fazer. E ele também faz com que a nossa inteligência artificial, o LLM, tome algumas decisões baseadas em alguns princípios e ele também trabalha muito forte em relação à parte de comunicação, padronização em relação à parte de comunicação. O porqu que eu estou dizendo isso Eu estou colocando isso aqui como orquestrador em par porque eu vou mostrar esses prompts trabalhando exatamente Um como um orquestrador outro como um comando que vai ser executado Então, esse aí é o grande ponto que eu quero que vocês entendam nessa introdução que eu quero trazer aqui para vocês, porque é uma nova forma, vamos dizer assim, de você ter possibilidades de fazer com que agentes trabalhem em conjunto, principalmente quando a gente está falando de codificação. E por conta disso, eu vou mostrar esses exemplos aí na prática, utilizando o Cloud Code. Lembrando que o Cloud Code, hoje, pelo menos no momento que eu estou gravando esse vídeo, ele possui recursos onde ele consegue trabalhar com subagentes ou com agentes dentro dele mesmo, inclusive de forma paralela. Então, comandos, aqui nesse caso, pode ser considerado um comando que é executado pelo Cloud Code. Mas, no final das contas, a gente sabe que esse comando simplesmente é a execução de um prompt. E, da mesma forma, nós temos esse orquestrador que vai servir para trabalhar de forma multi E lembrando pessoal n estamos falando aqui bastante do qu Pelo prisma da parte de prompts especificamente Eu não estou falando aqui no lado mais arquitetural, porque quando a gente está falando em arquitetura de software e de solução com o IA, nós também temos orquestradores, mas não necessariamente esses orquestradores são um, vamos dizer assim, um agente do cloud. Basicamente, esse orquestrador nosso aqui, o que ele faz é, através de um prompt, ele consegue trabalhar em conjunto com outras tarefas que estão sendo executadas. Agora, um ponto importante que eu vou falar para vocês é que, como tudo isso é prompt, independente da ferramenta de A que você está utilizando, você consegue ter resultados muito similares, por exemplo, mesmo que você não utilize um Cloud Code da vida que não possui, por exemplo, uma parte de comando. Porque o que é um comando, no final das contas, é a execução de um prompt. Então, eu quero deixar isso bem claro para você, porque a gente vai entrar com mais detalhes nos prompts daqui para frente. Fechou? Então, vamos nessa.", "data": "2026-01-14 00:20:34"}, "7": {"origem": "arquivo_local", "titulo": "7-Visão geral do workflow de um projeto.mp4", "texto": " Bom, pessoal, vamos lá então. Somente para você saber, eu estou abrindo aqui um documento que eu apresentei em uma das nossas aulas que nós tivemos. Então, provavelmente está na plataforma onde nós falamos sobre modernização de sistemas legados partindo através do Project State, ou seja, um snapshot de como que um projeto está atualmente. Então, eu não quero ficar necessariamente nesses próximos vídeos focando nessa parte de modernização de sistemas e falar um pouco sobre isso, porque essa aula já está gravada e você tem acesso a ela. Por outro lado, a nossa visão agora dessa aula que você já teve sobre esses aspectos importantes, eles vão ser aqui agora extremamente específicos em relação aos prompts que foram utilizados nessa aula onde eu falei sobre essa parte de modernização. Por outro lado, para garantir que nós não vamos perder a linha de raciocínio, eu quero trazer aqui novamente os três tipos de prompts que nós falamos até agora, que são os estruturados com resultados específicos, onde nós temos prompts mais especializados, ou seja, ele faz algo e retorna algo para a gente, como o auditor de dependências, por exemplo, mas também esses dois outros prompts que eu acabei falando aqui para vocês. Então, somente para a gente revisar um pouco isso, porque eu estou partindo do princípio que você já assistiu essa aula de modernização. Então, o negócio é o seguinte, pessoal. Deixa eu, inclusive, esconder essa parte aqui. Então, a ideia principal nesse momento, e eu vou ter que falar especificamente aqui do Cloud Code, porque é onde eu estou dando o exemplo. Talvez no momento que você esteja assistindo esse vídeo, o Cloud Code não seja a grande ferramenta que está sendo utilizada no momento. Pode existir outra ferramenta. Ou, eventualmente, ele pode ter mudado um pouco o comportamento. Ou outras ferramentas como o Gemini o pr Codex da OpenAI j fa coisas semelhantes etc O ponto que eu estou querendo dizer aqui que eu estou tentando deixar essa aula o mais prova de futuro poss para que esses conceitos fiquem claros independente de ferramenta. Fechou? Então, somente para a gente revisar rapidamente aqui, falando especificamente de codificação aqui com Cloud Code, que é o que eu vou mostrar o exemplo e vou trazer aqui para você, o negócio é o seguinte. Nós temos aqui o Cloud Code, que ele é um agente e ele é uma ferramenta, ou seja, ele é uma ferramenta de codificação que trabalha como um agente. Uma coisa importante que você tem que entender e lembrar do Cloud Code é que, como qualquer agente, na hora que você vai trabalhar com um LLM, ele tem uma context window, uma CW, context window, onde quando essa context window enche, por padrão o Cloud Code tenta compactar então ele vai perder um pouco de informação para que ele não realmente jogue fora as informações que foram passadas logo no início, que é uma das informações mais importantes que é a solicitação inicial, tá? O grande ponto é que o Cloud Code ele nos permite também a gerar agentes embaixo desse agente principal eu estou chamando isso aqui de sub-agente mas basicamente apenas para deixar claro para você que são agentes que esse agente principal do Cloud Code acaba gerando. Então, estou chamando de subagentes, mas se você, inclusive, for olhar no Cloud Code, ele chama isso de agente mesmo. Então, isso é uma questão de semântica. Então, somente para a gente entender o seguinte, toda vez que o Cloud Code executa e gera um novo agente, basicamente, o que ele sabe aqui é o seguinte, que existe um agente rodando, mas ele não consegue ter acesso à janela de contexto desse agente. E esse agente também não consegue ter a janela de contexto desse. Então, o que significa? Esses caras se comunicam conforme um vai chamando o outro, mas um não tem o histórico total dentro do outro. Um não consegue ler a informação que está dentro do outro. Então, eles têm input e output. O Cloud Code também possui comandos, que basicamente ele tem um prompt. Quando você executa esse comando, ele executa esse prompt e o Cloud Code começa a execução. Ent se voc perceber esses tipos de agente aqui que eu estou falando s agentes que normalmente nesse nosso caso v trabalhar de formas mais espec para gerar um resultado espec No caso no exemplo que a gente vai dar vai ser de relat sobre como s os componentes de um software, por exemplo. E a parte de comando é exatamente quando eu invoco o agente principal, trazendo para ele um fluxo de trabalho de como ele vai funcionar. Legal? Uma coisa importante é que quando você tem múltiplos agentes rodando em paralelo, nós temos um problema grave que é a parte de gerenciamento de estado. Então, gerenciamento de estado é um desafio gigante para qualquer desenvolvedor, arquiteto, na hora que for trabalhar com agentes ali com o IA. E eu não estou falando agente de codificação, eu estou falando em agentes mesmo, onde eu posso ter um agente que faz uma consulta, dentro de um sistema, pega resultados financeiros, depois faz algum cálculo, depois faz isso, depois faz aquilo, porque o estado é o que garante em qual momento esse agente está sendo executado. Então, isso aí é um ponto importante. O estado garante, é um snapshot de onde a execução parou. E nesse nosso caso aqui, o que acontece? Para a gente manter o estado do que está acontecendo na aplicação, nós vamos usar um agente orquestrador. Esse agente orquestrador trabalha de uma forma bem específica e simples, na realidade. Conforme o Cloud Code vai fazer a chamada e gerar outro agente para realizar uma determinada tarefa, toda vez que esses agentes terminam uma tarefa, esse agente orquestrador vai manter o tracking do que já foi feito. Então, ele mantém uma conversa direta aqui com o Cloud Code que vai informar sempre para ele quando alguma tarefa for concluída. Então, vamos imaginar que a gente iniciou uma tarefa, ele já fez diversos relatórios, por exemplo, que vão ser os exemplos que a gente vai trabalhar, parou no meio e eu posso, a partir desse arquivo de manifesto, continuar de onde ele parou. Lembrando, pessoal, a IA trabalha de forma probabilística e não determinística, tá? Então, mesmo a gente colocando um orquestrador, trabalhando com o mesmo prompt, n necessariamente a IA vai seguir passo a passo linha a linha do que voc colocar O que voc consegue fazer melhorar esse n de confiabilidade mas voc nunca vai garantir exatid E isso o grande desafio quando voc trabalha com o IA e por isso que inclusive quando nós vamos desenvolver agentes, não necessariamente de codificação, nós temos frameworks como o Lengraph, por exemplo, que consegue fazer com que você trabalhe de uma forma um pouco mais determinística no fluxo das execuções. Então, somente para você saber, eu tenho o agente principal, vamos dizer assim, o agente que cuida de tudo, eu tenho um orquestrador que fala com esse cara e que mantém o tracking aqui do projeto, e eu tenho o agente A, B, C, D, E, etc, que vão realizar as determinadas tarefas. A ideia desse orquestrador é que ele tente ser sempre um agente mais genérico, que ele consiga manter, vamos dizer assim, o tracking de qualquer tipo de projeto. Obviamente que para cada tipo de projeto você tem especificidade. Então, normalmente você vai fazer uma alteração ou outra, mas a ideia principal dele vai continuar sendo o mesmo, porque no final do dia tudo é prompt, beleza? Então, somente para você entender rapidamente o que a gente vai executar, e lembrando, isso já foi apresentado em uma aula, então vale a pena você assistir, aqui eu vou passar bem uma visão geral. A grande ideia aqui é a gente gerar um project state, ou seja, qual que é o snapshot atual do projeto, onde eu tenho qual é a arquitetura do projeto, quais são as dependências do projeto, quais são os componentes do projeto, com análises bem específicas. E, obviamente, você é mais do que bem-vindo em criar outros agentes que façam outras tarefas, como verificação de segurança, verificação da parte de testes e tudo mais. É um bom desafio para você fazer também. Então, a nossa ideia principal é executar um comando, que é um prompt, e é por isso que a gente tem essa aula, porque a gente vai avaliar esse prompt baseado na estrutura. Isso aqui vai ser gerado para o Cloud Code. O Cloud Code vai executar, ele vai entender o passo a passo do que deve ser feito, porque aqui ele traz um workflow bem claro aqui para a gente. E aí ele vai começar a execução. O orquestrador vai fazer o setup das pastas, criar um manifesto,", "data": "2026-01-14 00:20:39"}, "8": {"origem": "arquivo_local", "titulo": "8-Analisando prompt especialista em analisar arquiteturas.mp4", "texto": " Bom, pessoal, então vamos lá. Nas aulas passadas, eu trouxe aqui para vocês um dos formatos de prompts que são importantes e que a gente já viu. E são prompts especializados, inclusive, para a gente conseguir trazer saídas, conseguir trazer instruções negativas, como que a gente pode tratar erro e etc. Nós fizemos isso com um auditor de dependências. De qualquer forma, o que acontece aqui? Aqui eu tenho um projeto. Dentro desse projeto aqui, eu criei uma pasta chamada Agentes. Aqui eu estou dentro da pasta .cloud, porque especificamente eu estou usando o Cloud Code. Eu não estou dizendo, inclusive, que você é obrigado a ter o Cloud Code para fazer essa aula. Nosso ponto principal aqui não é o Cloud Code. Nosso ponto principal aqui está em você entender como que você cria e entende esses prompts, porque eventualmente você vai conseguir aplicar isso em qualquer outra ferramenta de IA que você for utilizar. Nesse caso, eu estou utilizando o Cloud Code, mas somente para deixar claro que não tem nenhuma obrigatoriedade para que você tenha que ter o Cloud Code para entender o que eu vou ensinar. Talvez você não consiga executar exatamente como o Cloud Code faz em outra ferramenta. Ferramentas têm comportamentos diferentes, mas é importante que você entenda os prompts e a ideia principal. Então, eu criei algumas pastas aqui. Nesse caso, a gente está numa parte mais exploratória, então é somente para uma organização minha aqui. E um agente especializado que eu quero trazer aqui apenas para a gente fazer mais um review dessa mesma estrutura de prompt, é esse Architecture Analyzer. Esse agente aqui, especificamente, criado pelo Cloud Code, ele tem alguns pontos extremamente interessantes e que vale a pena você entender. Primeira coisa que eu já quero deixar claro aqui para você é o seguinte, nós estamos falando desse tipo de formato aqui de agente. Essa parte aqui, basicamente, são metadados do Cloud Code. Então, eu não estou levando isso muito em consideração, mas basicamente ele traz aqui para mim qual é o modelo que vai ser utilizado, qual a cor que vai aparecer, exemplos de quando esse agente pode ser trigado, ou seja, quando ele pode ser chamado através do Cloud Code. Mas o nosso ponto principal está aqui, persona, objetivo, inputs, outputs. Eu vou tentar abrir isso aqui como MD para que a gente consiga analisar de uma forma um pouco mais clara aqui para a gente. Então, se você perceber, nesse nosso caso, a nossa persona, ou seja, a persona e o escopo nosso aqui, é o quê? É trazer que, já que o meu objetivo é fazer uma análise arquitetural de uma aplicação, o que eu quero trazer aqui para ele é falar exatamente isso. Você é um arquiteto de software, um cara que consegue analisar software de uma forma com uma expertise bem forte em analisar de código, entender padrões arquiteturais, system design, software engineering, best practice e etc. Por que eu estou falando isso? quanto mais informações nesse tipo do papel que eu acabo colocando internamente, de forma geral, eu já consigo colocar um monte de filtro na IA pra ela já entrar com esse contexto entendendo do que eu tô querendo falar tá, então basicamente isso o escopo, eu tô falando assim ó o seu papel é estritamente em analisar e reportar somente, você não vai modificar nada de um projeto, você não vai refaturar código, você não vai alterar o codebase de forma nenhuma, então aqui eu dei o escopo? No que ele é especialista? Ou seja, a gente consegue trazer um olhar diferente na hora que o Cloud vai rodar ou qualquer IA vai trabalhar, mas eu também estou dando um escopo muito grande, que ele não vai fazer nenhuma alteração no site. A ideia dele é ser um cara que vai fazer a geração de um report. Então, aqui nesse nosso caso, nós temos alguns pontos importantes, porque o meu objetivo aqui é fazer com que a gente consiga analisar a estrutura de um projeto de software. E o nosso grande desafio que a gente tem em fazer isso é porque, muitas vezes, nós temos projetos de softwares que são altamente grandes. Nós temos centenas de milhares de linhas de código. Como que eu consigo fazer, de uma forma cada vez mais otimizada, a leitura de tanto arquivo e, ao mesmo tempo, sem estourar aquela janela de contexto, onde a gente tem um limite. Por exemplo, a do cloud, nesse momento, ela é bem fechada, se não me engano, em torno de 200 mil tokens, então não é muita coisa, tá? Então, uma das formas que você tem para conseguir fazer isso é trazer objetivos bem claros do que ele tem que fazer, porque uma vez que ele entende esses objetivos, a forma de como que ele vai ler o codebase vai depender, tá? Então, isso aí é importante, porque não necessariamente eu preciso falar para ele ler 100% do meu codebase. Nenhum desenvolvedor nesse mundo precisa ler 100 do codebase para entender pontos arquiteturais de um software Ent isso a um ponto interessante Por outro lado existem algumas a que eu estou pedindo aqui como objetivos que vai sim fazer com que ele leia o Codebase Mas, de forma geral, quando eu consigo trazer esse objetivo mais claro aqui para ele, fica mais fácil ele entender quais ferramentas e qual estratégia que ele vai usar para ele mesmo internamente de como fazer essa leitura desse Codebase. Principalmente por quê? Porque cada agente de IA tem as suas próprias ferramentas. E, por exemplo, o Gemini tem suas ferramentas de conseguir entender e ler um codebase da mesma forma que o Cloud tem as ferramentas dele e etc. Então, o que vai acontecer é que cada um tem a sua manha. E eu não quero também especificar de uma forma tão forte para fazer com que a ferramenta dele se comporte da forma que eu quero. porque eu não quero isso. Eu quero que ele use as ferramentas da melhor forma que ele tem. Então, o que eu estou fazendo aqui é trazendo um objetivo claro. Então, eu estou falando, faça um mapeamento da arquitetura dos sistemas e dos componentes dessas relações. Então, para você fazer um mapeamento completo do sistema da arquitetura, não necessariamente eu preciso entender 100% dos arquivos. Mas, sim, necessariamente, na hora que eu bato o olho no sistema, eu consigo entender a relação entre um componente e o outro, eu consigo inferir essas informações, e é muito bom para fazer isso. E baseado nisso, ele consegue entender os componentes mais críticos, os principais módulos e o acoplamento onde ele consegue perceber onde tem uma coisa muito acoplada na outra. A nossa ideia aqui também é fazer com que ele faça uma espécie de análise de acoplamento, uma análise aferente, ou seja, todas as dependências que chegam em um determinado componente, e eferente todas as dependências que um componente tem em relação às outras. Isso aqui para a gente é super importante para a gente saber como que uma dependência, como um componente depende do outro ou quantos componentes apontam para o outro. Pedir, obviamente, aqui para ele ter e compreender documentações, pontos de integração com sistemas externos, bancos de dados e etc. verificar os riscos da arquitetura e pontos únicos de falha entender um pouco mais da parte de infraestrutura e padrões de deployment se existirem identificar os principais dívidas técnicas que precisam de atenção e identificar de forma high level riscos de segurança, potenciais vulnerabilidades na arquitetura e trazer essas coisas então se você perceber em nenhum momento aqui eu estou falando que ele leia 100% de tudo. Eu estou trazendo esses pontos e estou trabalhando aqui para que ele consiga usar da melhor forma esse tipo de análise. Eventualmente, dependendo de como for esse tipo de relatório, de como ele trabalhar e você não ficar contente, você pode rodar, por exemplo, esse tipo de prompt em outra ferramenta. Você pode tentar, por exemplo, um GPT-5, você pode tentar o Gemini, e que normalmente tem uma quantidade muito grande de tokens. Os testes que eu fiz até agora, mesmo com sistemas muito grandes, eu consegui ter um resultado bem favorável utilizando o Cloud, mas novamente, isso aqui é apenas um detalhe em relação à parte do LLM. Aqui em relação à parte de inputs, eu já estou trazendo aqui para ele o seguinte, o que você tem que ler, o que você tem de entrada para conseguir fazer essa tarefa? Então eu falei, olha, você tem o código de fonte de todos os diretórios, subdiretórios, você tem que olhar Dockerfile, Docker Compose, arquivos de Kubernetes, arquivos de variáveis de ambiente, arquivos que possam trazer automações como makefiles, gerenciamento de pacotes e independências. Então olha só, às vezes ele não precisa ler 100% dos arquivos para saber que ele está utilizando uma biblioteca X que está em uma versão desatualizada, por exemplo. Esquemas de bancos de dados, migrações, e outras instruções que eu possa passar ali para ele. Então, essa que é a ideia principal. E agora, a gente tem um dos pontos que é o mais importante e que é a parte que acaba ficando muito difícil para nós desenvolvedores quando a gente está fazendo qualquer prompt. E não é só desenvolvedor, qualquer pessoa que vai trabalhar com prompt, que é o output. O output é o que dá mais trabalho sempre. Então, eu estou indo mais a fundo novamente, pode ficar um pouco repetitivo o que eu estou falando, principalmente porque a gente já viu o de auditoria, mas eu queria trabalhar em cima desse cara aqui, somente novamente para reforçar essa parte de output. Então, o output aqui, eu estou falando, sempre retorne um markdown com o nome do report aqui para ele, com as seguintes sessões. E aqui eu estou falando, sumário executivo, a versão high level do System Architecture, a tecnologia, a stack e os principais findings, os principais pontos que ele encontrou de detalhes arquiteturais. Perceba que nesse caso eu deixei isso de uma forma mais genérica, então eu não vou ter tanto controle dessa resposta. Se as respostas e os testes que eu fizer não estiver me satisfazendo nesse sumário executivo, eu posso detalhar exatamente como eu quero. Mas normalmente os testes que eu fiz isso aqui est muito bons em parte de high level mas novamente voc fique na liberdade porque voc vai ter acesso a todos esses prompts tamb System overview, ou seja, eu quero que ele traga a estrutura do projeto, os principais diretórios e os principais patterns identificados. Então fica uma forma mais simples de eu conseguir entender um pouco a árvore do sistema. E agora eu pedi também para ele trazer uma análise crítica de componentes. ou seja, ele vai entender o que pode ser considerado um componente dentro do sistema e vai fazer uma tabela para mim, para eu trazer então tudo que você está vendo aqui e essas tabelas e tudo que eu estou colocando são exemplos porque é aqui que eu estou mapeando como que eu quero o resultado final da coisa nesse caso eu quero um relatório então eu não vou deixar por conta da IA entregar esse relatório da forma que ela quiser eu quero de uma forma estruturada para mim tanto que esse relatório vai ser utilizado como base para outros relatórios. Então, quando eu coloco aqui análise crítica dos componentes, ou seja, eu quero uma tabela com os componentes, sendo que muitos desses componentes podem ser módulos, features, bundles, packages, domínios, subdomínios no projeto. O que isso significa? Porque componente pode ser algo extremamente abstrato. Então, dependendo de como eu separo um projeto, sei lá, eu estou fazendo um projeto em Java, ele tem os pacotes deles com os namespaces deles. Se eu estou fazendo em .NET de uma forma, se eu estou trabalhando com Goa de outra, se eu estou trabalhando com PHP de outra, JavaScript de outra, dependendo da arquitetura, eu posso entender o que é um componente. Então, o que a minha ideia aqui é para que a própria IA, ela tente definir o que ela entende por um componente dentro do software. E para isso, eu trouxe alguns exemplos. Por exemplo, um user service, dependendo, pode ser um componente do tipo de serviço. Um database manager pode ser um componente de infraestrutura. Um billing pode ser um serviço. Um mensagem pode ser um componente de mensageria, como um RabbitMQ. Então, perceba que eu estou aqui dando exemplos do que pode ser um componente. Então, baseado nisso, ele vai entender o software e vai tentar extrair do que ele consegue interpretar do que é um componente. Provavelmente, se ele pegar um software que só tem classes, provavelmente ele vai poder considerar o componente baseado na leitura das classes que ele fez. Então, depende muito da arquitetura, dos layers da sua aplicação, por isso que eu deixei claro que ele pode definir aqui o que ele consegue entender como componente. Então, ele vai buscar se o projeto tem módulos, se o projeto tem algo de pasta de features, se tem bundos, por exemplo, o Symfony, por exemplo, um framework PHP, ele trabalha com bundos. Ou pode ser packages no Go, pode ser domínios, às vezes a pessoa trabalhando com DDD, então ele separa o projeto com pasta de domínios, subdomínios e coisas desse tipo. Então, dessa forma, eu pedi para ele fazer essa evaluação. E aí, eu pedi para ele colocar o nome do arquivo, o principal do componente, e aqui as ligações entre um componente e outro, ou seja, quantos caras estão usando esse componente e quantos caras esse componente está usando. E qual é o principal ponto na arquitetura do software que esse componente acaba fazendo. Então, se você perceber, eu trouxe apenas uma listagem bem simples dos componentes. Eu não estou sendo ultra específicos sobre cada um desses componentes. Também aqui eu estou pedindo para ele trazer um dependency mapping, ou seja, eu estou falando, olha, dependências de alto nível, controller, chama o service, chama o repositório, chama o banco de dados, um controller pode chamar uma API externa, um serviço pode chamar uma message queue. Pontos de integração, quando que eu falo com sistemas externos, Quando que eu tenho componentes que podem ser um ponto único de falha que vai fazer com que o meu projeto inteiro pare? E também pedir para ele fazer uma análise das tecnologias e stacks que eu estou utilizando. Também pedir para ele trazer pontos críticos de segurança que ele conseguiu ver. Também pedir para ele analisar como que o projeto hoje, se tiver, a parte de infraestrutura. E se você perceber, olha aqui que interessante. eu estou colocando only if our files documentation present, otherwise do not include this section. Ou seja, só vai ter essa seção se ele encontrar arquivos referentes a essa parte. Senão, essa seção nem vai existir. E eu pedi aqui claramente para ele salvar o report depois que ele fizer tudo com o seguinte nome, architecture report, e aqui eu pedi para ele colocar como se fosse data, uma espécie de um timestamp aqui, data o dia, mês, ano, hora, minuto e segundo aqui, dentro da pasta específica desse agente que eu determinei, que é barra docs, barra agents. Lembrando que se eu quiser depois mudar essa pasta, eu posso passar uma instrução para IA, substituir essa minha instrução. E depois, fizer isso, eu vou informar quem? O meu orquestrador ou o agente principal, aí vai depender de como que a ULLM quer trabalhar, falando que esse report foi salvo. Então, não inclua esse step no relatório. Eu não quero que no relatório apareça escrito final step. Basicamente é isso. E aqui eu tenho os meus critérios. E olha só que interessante, pessoal. Novamente, critérios de qualidade. Então, a gente viu o output de saída, critérios de qualidade agora. Olha passe por todos os diret para entender a estrutura identifique os principais padr foque no que significante para os componentes da arquitetura, ao invés de olhar todo o arquivo tente calcular as métricas mais críticas dos componentes aferentes e eferentes foi o que eu pedi inclusive lá em cima tente mapear o fluxo de dados, identifique a infraestrutura, verifique os, vamos dizer assim, os limites de cada componente e as integrações. Veja a parte de escalabilidade e potencial a bottlenecks, pontos que podem ser furos em relação a isso. Entenda quais são antipatterns e débitos técnicos que eu tenho aqui. Priorize os componentes pela arquitetura e importância no impacto do negócio. Analise e configuração, o gerenciamento de configurações. Também a parte de documentar esses limites para que ele consiga entender esses patterns. Outra coisa, identificar o que são bibliotecas compartilhadas. Sempre traga o caminho relativo quando eu for referenciar qualquer coisa, para que ele não pegue a minha pasta home da minha máquina inteira. apesar que às vezes mesmo assim ele pega, galera. E antes de apresentar os acoplamentos aferentes e inferentes, introduza esses termos e como que eles funcionam isso em um parágrafo. E a gente vai ver que ele explica o que é um componente aferente e eferente ali no relatório. E aqui eu estou trazendo novamente ambiguidades e assumptions, ou seja, o pressupostos. Se encontrar múltiplos padrões que estão presentes, documente cada um separado. Se tiver arquivos faltando de ministra a estrutura, bote isso como limitação. Então, se você entender, eu estou trazendo diversos pontos que eu quero pensar para evitar ambiguidade caso alguma coisa aconteça. E aqui, instruções negativas. Nunca modifique os arquivos, não traga sugestões, não crie, modifique, não faça diagramas, não assuma nenhum padrão se você não tiver evidência não traga detalhamentos de otimização e sugestão de performance não inclui tempo que ele vai demorar porque muitas vezes gera um plano e fala na primeira semana você vai melhorar isso na segunda semana você vai ter uma tarefa de duas horas às vezes ela faz essas coisas eu não quero estilização, emojis nos meus reports eu não quero que ela crie e alucine fabricações de informação Ou seja, traga as informações mais possíveis. Se você não tem nada, fala que você não tem. Você não tem essa informação. Não dê recomendações, sugestões de improvement. Aqui é um relatório, é um snapshot. Eu não estou tendo um consultor aqui na minha vida. Eu só estou falando o que eu quero. Se ele não conseguir performar essa análise, eu quero que ele traga isso aqui como resultado. E aqui, galera, é um ponto importante. que é como se fosse um reforço de tudo o que aconteceu. Então, apesar de ele entender tudo isso, eu coloquei um workflow aqui passo a passo, para que ele consiga seguir. E se você perceber, esse workflow no final do dia, ele apenas é quase que um resumo de cada item do relatório que eu estou precisando. Então, isso aqui ajuda muito a IA, porque agora que ela entendeu o que a gente quer, eu estou falando como que ela deve trabalhar. Basicamente é isso. Eu estou colocando. Então, aqui é como se fosse um resumo de tudo que ela tem que trabalhar. Inclusive, eu dou detalhes aqui. Se o usuário der o caminho e o nome do arquivo, gere o report baseado no que ele colocou, sem precisar pedir uma confirmação para o usuário. Então, se você olhar aqui, galera, é um prompt, tá? Obviamente, dá trabalho para escrever. Eu tenho que dizer que eu rodei esse cara várias vezes para ficar da forma como eu queria. E, obviamente, ainda, eu poderia adicionar muitas outras partes, muitos outros detalhes nesse componente, mas eu acredito que aqui é um bom ponto de partida, inclusive para você rodar esse prompt no sistema da sua empresa, de alguma forma, obviamente, sempre entendendo a parte de privacidade, estando ligado com as regras, as políticas da empresa, para você não colocar dados sensíveis da sua empresa em inteligências artificiais que não sejam homologadas. Então, quero deixar isso bem claro para você pensar também nos riscos e para você seguir as regras da empresa que você está trabalhando também. Então, isso aqui, galera, novamente, é um prompt que traz resultados específicos. Esse cara é um especialista realmente em analisar arquiteturas de aplicações e eu tentei trazer uma abordagem para fazer com que ele não tenha que ler todos os arquivos porque isso é uma visão um pouco mais de alto nível, tá bom? E conforme a gente for andando, eu vou trazer mais alguns exemplos aqui para vocês de caras especialistas e depois a gente vai para orquestrador e a parte de comando também. Então vamos nessa.", "data": "2026-01-14 00:20:48"}, "9": {"origem": "arquivo_local", "titulo": "9-Analisando prompt de analise de componentes.mp4", "texto": " Bom, pessoal, da mesma forma que a gente fez isso para a arquitetura do sistema, eu quero mostrar novamente o mesmo prompt. Galera, isso aqui é uma disciplina de prompt engineering. Eu não posso deixar de falar dos prompts. Eu sei que a gente já entendeu essa estrutura básica, mas eu quero trazer e tentar explicar cada vez mais exemplos que eu puder para que você consiga otimizar o seu tempo e ter até um pouco mais de insights para você fazer os seus próprios agentes, os próprios prompts aqui. Então, somente para você entender, novamente, o cara, a persona e escopo é basicamente a mesma coisa, onde ele faz análise de código. E aqui também, inclusive, lógicas de negócio, extração de lógicas de negócio. Perceba bem o que eu coloquei aqui, extração de lógicas de negócio. Então, o objetivo dele é fazer uma compreensão em nível de componente, porque antes a gente teve uma compreensão em nível de arquitetura geral do sistema e naquele documento nós tivemos a listagem dos componentes do sistema. Então, a nossa ideia aqui é que esse prompt pegue cada componente que existe listado naquele relatório de arquitetura e gera um relatório específico para cada componente. Então, aqui o que eu estou pedindo? Mapear completamente a estrutura e a organização desses componentes. Extrair os documentos e todas as regras de negócio, lógicas de validação, use cases e regras de domínio. Analisar implementações, algoritmos e data flow, ou seja, o fluxo de dados daquele componente. Identificar as dependências internas e externas e as integrações, documentar e entender os design patterns, as decisões arquiteturais e os atributos de qualidade. Isso aqui, no final das contas, é o que define, inclusive, o que é a arquitetura. E entender o acoplamento de cada componente a coes e os seus limites arquiteturais entender pontos de seguran como que ele est vendo erros padrões de resiliência, identificar dívidas técnicas e codes MELS aqui para a gente. Então, esse é o objetivo principal. Se você perceber, agora eu estou sendo um pouco mais detalhista em relação ao que ele vai ler na quantidade de arquivos. provavelmente ele vai como eu estou analisando especificamente um componente apenas eu posso ser mais preciso e falar para ele ser um pouco mais agressivo na leitura dos arquivos que estão dentro desse componente, porque com certeza são menos arquivos do que tem no projeto como um todo, como a gente fez na arquitetura mas novamente depende do nível que você quer olhar por exemplo, se você tem na sua empresa um componente muito grande, provavelmente você poderia rodar um outro prompt ou uma outra chamada para ele gerar subcomponentes para você ter um relatório mais preciso do que isso acontece, então você pode ir do alto nível e baixando o nível, e cada nível que você vai baixando você pode ter um prompt diferente tudo isso vai depender do tamanho do projeto, novamente não tem uma regra geral que vai funcionar para todo mundo então provavelmente esse prompt que eu estou utilizando aqui para você, dependendo da situação, não pode trazer tanta informação da forma como você queria ou às vezes pode trazer até mais informação do que você gostaria. Por isso que é importante você ter autonomia para você conseguir trabalhar nos seus prompts e não ficar dependendo, obviamente, somente dos prompts que eu trago aqui no curso para você. Legal? E aqui são os inputs. O input é o componente, os serviços, os diretórios onde estão identificados no report de arquitetura, porque lá tem os caminhos, os arquivos e as implementações, as interfaces, os testes, as documentações, os arquivos de configuração, os arquivos de testes, desde fixtures, desde mocs, dependências, declarações, os imports. E opcional, ele pode olhar o arquivo de arquitetura e ver quais são os componentes mais críticos para entender um pouco melhor e outras an que o usu pode trazer Outros pontos Output novamente aquela parte que d trabalho Ent sumar executivo a DataFlow ou seja como que esse componente funciona em relação a passo a passo. Então, recebi uma solicitação num controller, foi para uma validação, caiu na regra de negócios da parte de processamento, chamou o Stripe, depois persistiu no banco de dados, mandou uma mensagem e retornou ali para um response builder, por exemplo. Entendeu? Então, a ideia é somente para a gente ter uma ideia de como que o fluxo de dados acontece dentro daquele componente. Outra coisa que eu pedi aqui para ele é para ele extrair as regras de negócio de forma quebrada para cada regra de negócio que ele encontrar no sistema. Por que isso é importante? Porque, às vezes, quando eu vou ver um componente, cada componente tem sua regra de negócio. E um componente pode ter diversas regras de negócio. Então, para eu fazer análise e entender um pouco melhor a aplicação que eu estou analisando, provavelmente ter uma ideia de um resumo básico das regras de negócio que aquele componente faz acaba sendo relevante, pelo menos na minha opinião. Aí vai depender de cada um. Então, a minha ideia aqui foi o overview das regras de negócio. Então, basicamente o que eu trouxe, eu criei uma tabelinha em markdown falando qual o tipo de regra, por exemplo, uma validação, qual que é uma descrição dessa regra, Por exemplo, o pagamento mínimo tem que ser de um dólar e aonde está esse arquivo e a linha dessa regra de negócio. E eu fiz isso. E depois disso, eu pedi, inclusive, para ele gerar aqui para mim um detalhamento de cada regra de negócio. Então, eu coloquei regra de negócio, o nome da regra, uma visão geral da regra de negócio, a descrição mais detalhada dessa regra de negócio e pedi para ele trazer um workflow básico de como que funciona essa regra de negócio. Então perceba, galera, que eu estou usando aqui XML ou uma forma como se fosse um placeholder para ele entender que aqui é onde ele vai escrever, porque eu estou colocando uma definição em Markdown aqui para ele, então ele pode confundir. Então eu tento deixar isso da forma mais clara possível ali para a gente. E na descri eu estou falando olha use pelo menos tr par traga o m de detalhes poss de uma forma f de entender como que as regras de neg funcionam para cada componente E aqui eu pedi para ele trazer também a estrutura de componentes, análise de dependências, parecido como a gente fez, mas agora de mais baixo nível, componentes aferentes e referentes, como eu tinha falado, os endpoints, caso exista endpoints. Nem todo componente tem endpoint, mas se esse componente tiver um endpoint, ele vai trazer. e eu falei que um endpoint pode ser considerado, por exemplo, um REST, um GraphQL, pode ser um GRPC. E se esse componente não expor nenhum endpoint, não incluir essa seção. E eu coloquei aqui uma regra mais específica. Se o componente for REST, use o formato abaixo. E daí eu coloquei endpoint, o método e a descrição ali para a gente. Depois, pedir para ele trazer pontos de integração, os patterns estão sendo utilizados, os riscos técnicos, análise de cobertura de testes. pedi para ele salvar o report e fiz o final step e trouxe novamente outros critérios que eu acabo entendendo que são importantes para ele decidir e trabalhar ali para a gente. Também análise de ambiguidades, instruções negativas, como ele trabalha com o erro. E novamente aqui, galera, olha só, o workflow, que é como se fosse um resumo de tudo que eu coloquei lá em cima para que a IA possa seguir esse passo a passo. Então, esse workflow é um resumo, ele é interessante muitas vezes quando você tem muita informação e muita instrução. Eu gosto de colocar esse workflow. Se você olhar aqui no formato de prompts, eu não estou colocando aqui o workflow, mas eu vou até adicionar e eu vou deixar como opcional o workflow. Opcional, porque vai depender do tipo de tarefa que você vai fazer. Se ela é muito complexa, se ela é muito longa ou coisas desse tipo, você pode colocar um workflow ou não. então galera, isso aqui foi mais um exemplo de como eu utilizei esse tipo de prompt para ele fazer uma análise interna de componentes de uma aplicação daqui para frente a gente vai ver outros tipos de componentes que vão ser importantes para a gente também", "data": "2026-01-14 00:20:54"}, "10": {"origem": "arquivo_local", "titulo": "11-Role Specification como Orquestrador.mp4", "texto": " E agora, pessoal, a gente chegou nesse último camarada, que é o nosso orquestrador. E somente para deixar muito claro aqui para vocês, essas são sessões sugeridas que eu recomendo para agentes desse tipo. Isso não significa que você não consegue fazer a mesma coisa aqui com essa estrutura ou, eventualmente, com essa. É tudo a forma de como você quer trabalhar. Essas estruturas vão te ajudar a não partir do zero e são recomendações, beleza? Então, por conta disso, eu quero trazer agora aqui esse Role Specification, onde a gente deixa claro esses aspectos aqui de definições, responsabilidades, framework operacional, decision making e communication standards, tá? Então, vamos lá, galera. Vamos falar do nosso orquestrador. Então, basicamente, eu estou criando um papel, como sempre a gente acaba fazendo isso, dizendo quem ele é. Então, nesse caso, eu estou falando que ele é um agente orquestrador de tarefas que vai ajudar a coordenar um ambiente onde o Cloud Code, nesse caso, que é o Mastercard, vai conseguir controlar agentes e fazendo a chamada desses agentes de forma paralela. Então, a ideia aqui é que esse agente consiga garantir a estrutura, caminhos e a auditabilidade desse multi-agente work ou seja, a ideia desse nosso orquestrador é ele garantir a fonte única da verdade para esse nosso manifesto.md que ele vai criar para garantir que tudo que for gerado do nosso projeto seja traqueado ali para daí nós termos certeza de todo o material que foi feito durante à execução, para daí então aquele comando gerar o nosso índex com todos os relatórios gerados, tá? Então, responsabilidade core dele, perceba aqui que eu não estou colocando necessariamente o que ele tem que fazer, tá? Mas sim o senso do que são pontos inegociáveis desse camarada. É um pouco diferente de objetivo, porque o objetivo ele dá uma visão mais a curto prazo, vamos dizer assim, do que vai ser feito. Aqui, na especificação e no papel, a gente já deixa uma ideia do que vai ser feito pelo escopo, mas a gente traz algumas responsabilidades que são importantes aqui para ele. Nesse caso é inicializar a estrutura do projeto criando um arquivo de manifesto. registrar todo o output das tarefas que foram completadas, e eu dei aqui usando o barra na frente, que vai ser utilizado como nome do relatório, com o agente que vai produzir. Garanta que essas políticas e normalizações vão ser baseadas nos argumentos que vão ser passados, e que a gente manda lá nos comandos. Garantir que cada componente possa ser comparável com a lista de componentes que vão ser gerados no nosso relatório de arquitetura para garantir que estão todo mundo registrado lá bonitinho para quando todo o trabalho terminar, ele conseguir sumarizar e a gente ter todos os relatórios que a gente precisa. E também a ideia é que como esse cara mantém o tracking de tudo que está sendo registrado, ele vai ajudar a prevenir, validando se há duplicações ou não nesses camaradas. E, no final das contas, também ele vai ter que validar e finalizar o manifesto.md. Então, se você perceber, pessoal, eu consigo, se eu fizer uma força não tão grande, portar essa estrutura para algo desse tipo ou para algo desse tipo por esse camarada aqui ele n tem uma complexidade t grande que a gente precisa tanta coisa nele Então, eu consigo deixar ele um pouco mais leve para não ser, inclusive, um prompt tão grande. E lembrando, quanto maior o prompt, maior a ambiguidade, maior a chance das coisas darem errado. Então, o nosso prompt tem que ser o mais assertivo possível. outro ponto agora que é o framework operacional ou seja, o workflow que ele vai trabalhar então, pontos importantes ponto da verdade aqui vai estar o caminho do manifesto e tudo que vai ser armazenado vai ser aqui por outros agentes vão estar registrados aqui somente o orquestrador escreve no manifesto.md como é que vai ser gerado os arquivos? a partir de onde? de qual parte? isso aqui vai ser gerado então isso aqui pra gente é um ponto super importante. Outra coisa importante é, não invente nome de pasta, não crie reports, outputs. Então, a gente está aqui no final das contas garantindo que esse nosso orquestrador, ele só vai trabalhar com manifesto.md e garantir que tudo que está sendo feito pelos outros agentes, ele vai estar fazendo double checking para garantir que quando todo o trabalho terminar, ele vai poder sintetizar tudo para daí a gente ter o resultado final. Registration Workflow. Quando o Master Coordinator, que é, no caso, o nosso Cloud, completar um artefato, grave imediatamente isso no manifesto.md, com o título, com o caminho absoluto, o nome do agente e o timestamp. Antes de gravar isso, verifique se o caminho existe. Componente Average Control. Estou falando, leia o diretório de arquitetura, o reporte de arquitetura, para garantir que todos os componentes fiquem lá no manifesto.md. Importante, grave no manifesto.md de uma forma que eu posso conseguir fazer o tracking de tarefas que estão pendentes para cada componente. Se qualquer componente faltar algum relatório e você verificar esse gap, passe isso para o seu coordenador, que é o Cloud, para que daí ele vá, provavelmente, chamar outros agentes para terminar aquele relatório. E aqui, a parte de finalizar a integridade. Então, confirme que todas as sessões estão no manifesto.md, valide cada caminho registrado, remova as duplicações. Então, isso aqui são pontos inegociáveis que é como ele vai trabalhar. E aqui eu tenho um decision-making principles. É uma forma de eu remover ambiguidade também. Então, por exemplo, separation of concerns. The master coordinator decides qual agente deve rodar e quando. O orquestrador apenas enforça a estrutura, a cobertura e o registro. Parallel safe recording. Registrar os outputs S1 o quanto antes para evitar problemas de race conditions. Ou seja, porque eu posso ter vários agentes modificando o mesmo arquivo ao mesmo tempo. Então, esse aí é um problema que pode acontecer e a gente não está isento. Isso aqui não é um banco de dados que a gente tem isolamento, mas, de forma geral, eu já percebi que, por exemplo, no comportamento do Cloud, ele percebe quando tem arquivos abertos, ele acaba mudando através de uma diferença ali. Ele faz um diff para não ter aquele tipo de problema. Então, eu não tive problema de race condition em relação a isso. State mínimo necessário ou seja, mantenha as notas operacionais mínimas e factuais para não ter que ficar fazendo recomendação sumarização, nada disso ou seja, trabalhe com o menos dado possível trabalhe com caminhos determinísticos para garantir certamente onde vai estar os nossos relatórios Safety over convenience então evite, ele não ele vai refutar, ele não vai registrar qualquer item de um caminho ou qualquer coisa duplicada que ele possa verificar Ent ele tem que verificar Ent a grande sacada aqui que eu vou trazer para ele conceitos que fazem com que eu tenha mais segurança na hora que esse orquestrador vai rodar. Tudo isso vai funcionar da melhor forma possível? Vai depender muito do modelo que você vai utilizar, vai depender muito do projeto que estiver rodando. com todos os testes que eu fiz aqui, eu tive ótimos resultados, mas isso não significa que sempre você vai ter o melhor resultado do mundo. Por isso que Prompt é algo evolutivo a cada momento, principalmente quando lançam modelos novos aí de A. E aqui, Communication Standards. Por que isso aqui é importante? Porque o nosso orquestrador vai falar com o coordenador, então a gente tem que garantir algumas coisas. Ou seja, nunca se comunique diretamente com o agente especialista. sempre traga de forma clara e estruturada as atualizações quando foi perguntar um status retorna uma lista de reports com o arquivo, com o título absoluto com o nome do agente com o timestamp e a checklist com os componentes que estão faltando aqui instrução e formato para o master coordinator a gente tem que lembrar que o nosso orquestrador ele vai falar diretamente com o cloud code Então, eu estou querendo aqui gerar para ele uma forma de fazer com que esse orquestrador se comunique de uma forma muito clara para esse cara, porque o Cloud Code aqui é ele que vai executar as outras tarefas e chamar outros agentes. Então, eu estou querendo fazer com que essa comunicação seja muito bem feita. Então, a instrução e o formato ali para o coordenador master. Então, especifique o diretório de saída para o especialista, seguindo o mesmo padrão, ignore qualquer coisa que não seja respeitada. Lembre-se sempre que quando um especialista finalizar, o resultado tem que ser retornado para o orquestrador para registrar. E aqui, manifeste disciplina. Somente o orquestrador edita e manter o manifesto limitado a traquear reports com o mínimo workflow, notas e coisas desse tipo. E ações proibidas. Ele não vai poder gerar vários agentes, ele não vai gerar sequências de agentes ou vai fazer prescrições de mudanças de código. Ele não vai criar sumário executivo, recomendações, vulnerabilidades, ali no manifest.md. Ele não vai estimar horas, não vai trabalhar com linguagens vagas e vai trabalhar da forma mais segura possível. Por que eu estou colocando isso? Porque esse tipo de comunicação, apesar de muitas dessas coisas estarem em outros prompts, aqui eu estou reforçando do que vai ser o comportamento do agente orquestrador. Então, se você perceber, é um template, é um prompt muito mais simples, porque ele traz basicamente a responsabilidade, como ele vai trabalhar, que é uma forma simples de manter o tracking de algo, e alguns princípios para tomar decisão em algum momento. Ou seja, separar as responsabilidades, trabalhar de uma forma segura quando for trabalhar de forma paralela, gravar e sempre mandar as informações com o mínimo possível, trabalhar com os caminhos determinísticos e também não registrar qualquer coisa que viole o que já foi combinado. E as nossas comunicações são importantes porque é como ele fala com o Cloud Code ali de forma geral. Então essas instruções para o Cloud Code são importantes porque aí eles mantêm, eles criam uma espécie de um protocolo de comunicação. É em linguagem natural, vamos dizer assim, mas ainda assim a gente garante que o Cloud Code está recebendo respostas e o orquestrador tamb est recebendo informa de uma forma mais precisa baseado nesses standards a que voc pode ir aprimorando o tempo todo E aqui eu coloquei um template de como vai ser o manifesto ou seja, o nome do projeto, o gerador, o caminho do orquestrador. Aí eu coloquei os reports, os componentes, por exemplo, e o workflow, o tasks, ideas, timestamp para cada report colocado, se já foi completado, se está pendente, se falhou, e anota as mínimas ali do que acontece. Então, com esse tipo de comportamento, a gente já vai conseguir, no final das contas, ter esse arquivo de manifesto, que na realidade é um arquivo apenas para a gente saber de onde a gente parou. É o arquivo que mantém o estado do nosso workflow em geral, quando eu tenho muitos agentes rodando. Eu poderia ser mais específico, inclusive nos comandos, sendo mais enfático que dentro das regras, terminou um agente, inicia um novo orquestrador para ele somente registrar. E você pode fazer isso e o Cloud vai criar um orquestrador para cada vez que uma tarefa for concluída. porém, o que eu percebi ao longo do tempo é que o resultado demora mais porque ele vai ter que subir o novo orquestrador dar baixa no arquivo e etc, então isso acaba demorando um pouco mais, por outro lado eu tenho o tracking mais em tempo real então da forma como está aqui, na maioria das vezes ele vai fazer aqui para mim o tracking dos dois relatórios primeiros, aí ele vai terminar a fase 3 ali, fazendo o relatório de cada componente e vai mudar o manifesto quando ele terminar todos. O grande problema de estado aí é que se a gente encerrar a sessão no meio desse processo e o orquestrador não tenha anotado, a gente vai ter que refazer esse processo como um todo. Então, é um trade-off no final das contas. Para cada tarefa gera um orquestrador para ele guardar, vai demorar um pouco mais, mas eu mantenho o tracking ou ele mantém o tracking quando ele terminar todos aqueles trabalhos em paralelo, vai depender de como você quer, da forma como está aqui, ele vai esperar todos aqueles em paralelo terminar para ele sair registrando, mas vai depender muito do seu comportamento, do tamanho da tarefa, do tempo do projeto o que eu quero sempre deixar claro galera, é que prompt é algo infinito, é algo que você testa, gasta muito tempo, gasta muito token para fazer isso no final das contas, mas é um trabalho que quando você vê tudo isso funcionando, acaba dando bastante orgulho, porque ele acaba realmente matando diversas dores que a gente tem na hora de a gente desenvolver um software ou fazer, por exemplo, relatórios dessa forma como a gente está trabalhando, beleza? Então, esse aqui é o nosso orquestrador, ele é bem simples, por isso que eu não quis utilizar outras estruturas que acabam sendo um pouquinho mais complexas em uma estrutura que pode ser mais simples nesse caso por conta do orquestrador. Então, por isso que a gente categorizou dessas formas, mas, vamos dizer assim, a grosso modo, a gente consegue adaptar e você não precisa ficar preso exatamente nisso, da forma como eu coloquei. Fechou? Então era isso, galera, que eu queria passar por essas estruturas de prompts. Elas realmente são importantes e eu espero que você esteja aproveitando. Saiba que você vai ter acesso ao repositório com todos esses prompts para você fazer os seus testes, para você melhorar esses prompts, para você ter uma visão mais crítica e inclusive conseguir tirar resultados ainda melhores. Fechou? Um grande abraço e é isso aí.", "data": "2026-01-14 00:21:08"}, "11": {"origem": "arquivo_local", "titulo": "10-Workflow Specification Prompt.mp4", "texto": " Bom, pessoal, eu acho que com esses últimos vídeos, que inclusive acabam sendo um pouco repetidos, mas novamente, galera, a gente está falando de prompt, eu quero gerar a maior quantidade de insights possíveis para vocês. Então, o que acontece é o seguinte, esses tipos de prompt eu acredito que já ficou claro aí na sua mente. Agora, eu quero falar desse camarada aqui, que são prompt específicos que a gente utiliza para workflows. Então, vamos lá, eu vou fechar esse cara aqui e vou abrir para esse camarada que ele é um comando. Esse comando, no final das contas, é um comando que o Cloud Code executa. Então, entenda uma coisa, apesar disso aqui ser um comando que é executado via Cloud Code, é importante você saber que um comando ou um prompt pode ser executado em qualquer inteligência artificial. Mas especificamente esse comando, eu faço com que ele trabalhe de forma multi-agentes. E por isso que é importante você entender a estrutura desse cara. E somente para você saber, não necessariamente você precisa trabalhar de forma multi-agentes para ter um prompt que vai forçar um workflow de uma forma mais detalhada. Nesse caso aqui, eu acho que fica bacana porque dá para você ter um pouco mais de clareza de como tudo isso aqui ficou. Então, aqui é o nome do meu comando Basicamente aqui é uma forma de eu ler e entender do que aquilo se trata É muito mais sobre isso do que necessariamente mandar ele fazer Apesar do que o nome acaba já ajudando a entender aquele contexto Mas aqui basicamente eu estou trazendo uma descrição Que é o seguinte, produza de forma completa e auditável um snapshot de um projeto coordenando agentes especialistas e consolidando as outputs deles. E aqui, galera, é uma forma de eu estou tentando definir semanticamente o que cada agente pode ser e como ele é nomeado. Por quê? Porque o próprio Cloud Code, nesse caso, ele é um agente. Então, toda vez que eu falei Cloud Code entre parênteses e U, ele sabe que eu estou falando com o agente principal dele. E eu estou falando que ele funciona como um coordenador. O orquestrador, o agente orquestrador, somente vai preparar uma estrutura para depois sintetizar os outputs. E aqui, galera, novamente, é o ponto mais importante de todos, que é o output. Se você olhar aqui nessa minha descrição, de uma forma geral, eu estou dando um output na descrição aqui desse cara. Mas como o foco desse nosso amigo aqui é gerar muito mais, focar muito mais no workflow, eu não estou, na realidade, pegando tão pesado em como que vai ser todos os detalhes do output, apesar de eu colocar um template abaixo. Mas o ponto principal aqui é que eu estou falando aqui, sua final delivery ou seja, o que você vai entregar como resultado final basicamente é tudo que esse cara faz apesar de ele gerar vários efeitos colaterais, fazendo com que múltiplos agentes sejam chamados no final do dia ele vai gerar um readme nesse formato aqui usando a data atual para não ter perigo que vai ser gravado dentro do diretório do agente orquestrador, isso aqui foi opção minha, com uma descrição do projeto e com um índice linkando todos os relatórios produzidos pelos agentes. Então, quando você criar o readme, vai ser um índex listando os arquivos por arquivos, usando o caminho absoluto, começando pelo barra do repositório que ele está trabalhando. Então, aqui eu dei um exemplo de como é um markdown, Então, project architecture barra o link to report. É assim que em markdown a gente define um link. Então, eu também pedi para ele na descrição, para ele validar todo o link antes de salvar no readme, para garantir que o caminho existe. Use o manifest.md, gerenciado pelo orquestrador, o agente orquestrador, a gente vai falar dele mais tarde, como fonte da verdade para mapear todos os reports. Isso vai ser inicializado na fase 1 e vai ser alterado a cada vez que um agente completa as fases. Daí a gente vai falar um pouco mais sobre essas fases ali. E aqui eu dei um output template, se você olhar aqui para a gente. Output template O que o output template Como que eu quero de resultado final Ent aqui eu falo o que a parte que vai ser entregue que vai ser um Aqui eu estou definindo como que vai ser esse índice. Eu fiz de uma forma bem simples. Nome do projeto, uma descrição breve do projeto, uma descrição explicando sobre os pontos principais desse documento com a consolidação e os aspectos principais do projeto, como se fosse um raio-x. pedi para ele colocar a data de geração coloquei um overview e a arquitetura do software então tem um project overview, caso queira um project architecture, os componentes e as dependências, perceba que cada cara desse é um agente diferente que vai chamar e aqui eu coloquei também critical constraints, ou seja restrições críticas nunca dê o fluxo completo para o agente orquestrador O orquestrador somente executa algo com duas responsabilidades. Na fase 1, para criar o projeto, a estrutura do projeto, ou de forma explícita, quando a gente fala o folder, o output folder, ou os folders que vão ser ignorados. Fase 4, que ele vai sintetizar todos os relatórios gerados pelos agentes. pedir para ele ser de forma estrita, extremamente restritivo pela separação dos agentes ou seja, invoque cada agente especialista e separe para cada tarefa o orquestrador, o agente orquestrador não deve chamar subagentes o Cloud Code Rio vai ser responsável por coordenar a sequência, então o orquestrador e a gente vai falar de orquestrador daqui para frente também ele não vai ser o cara responsável por chamar os agentes. Quem faz isso é o Cloud Code. O orquestrador apenas mantém o tracking do que já foi feito. E aqui eu falei, siga exatamente o que está escrito na especificação de cada agente. Então, isso eu estou garantindo para fazer com que ele leia o conteúdo de cada agente para evitar com que ele esqueça qualquer coisa. Nunca escreva os outputs fora das pastas que foram pedidas. Nunca dê recomendações ou planos de ação. novamente porque eu não quero isso eu quero um raio X só do projeto nunca traga o tempo de duração evite linguagens válidas como isso aqui é probably safe ou isso pode dar certo pode ser bom não fabricate CVIs basicamente os bancos de dados de vulnerabilidades ou seja, somente traga essas vulnerabilidades, se você conseguir ver que foram produzidas pelo nosso agente de auditoria. E aqui, eu coloquei ainda essas constraints bem específicas. Pontos importantes para a separação de agentes. Cada agente tem que ser invocado numa task separada. Ou seja, eu vou fazer uma chamada, uma tool call, que vai ser uma tarefa. O agente orquestrador não deve ser pedido para gerar subagentes para ele mesmo. Você é o Cloud Code, você é o coordenador, não é o orquestrador. Estou tentando deixar bem claro que coordenador é o cara que vai gerar os agentes, que está recebendo o comando, e o orquestrador é o cara que mantém o progresso dos relatórios que vão ser feitos para serem sintetizados e gerar o relatório final. Todas as comunicações acontecem por você. Você decide quando um novo agente começar. Depois que um agente finalizar, você precisa chamar o orquestrador para alterar o manifesto. Na prática, isso é o Min. Toda vez que a gente vai chamar uma task orchestrator, uma vez que essa tarefa é completada, você tem que fazer alteração no manifesto. Basicamente é isso. Então, eu dei um exemplo. Quando uma tarefa para o architecture analyzer for completada, você tem que invocar o orquestrador para guardar no manifesto.md que essa tarefa foi terminada. Nem sempre o Cloud vai querer trabalhar dessa forma. Às vezes eu peço e ele faz isso, às vezes ele espera eu terminar os relatórios para sintetizar tudo, tá galera? Novamente, depois se você estiver se incomodando muito com o comportamento que ele não está trabalhando para você, o que você pode fazer? Você pode ser ainda mais específico ali em alguns pontos. Aqui, galera, é o ponto de ouro, que é o workflow que vai ser executado. E uma das formas bem simples, que garante de uma forma, garante não, que maximiza a chance de sucesso para que esse workflow seja seguido é você separar por fases o fluxo daquilo que vai ser executado. Então, o que acontece? Eu coloquei fase 1 e eu coloquei uma tarefa entre parentes o nome do agente, para ficar mais claro para ele entender. Então, entenda as flags para trabalhar e entender os caminhos, porque eu posso ter diversos caminhos dentro dos meus diretórios, porque esse orquestrador ele vai ter que entender realmente a estrutura de projetos do meu arquivo porque ele vai ter que gerar um manifesto respeite o menos menos project folder menos menos output folder quando provided se n for provided use as localiza padr que vai ser dada pelo orquestrador por exemplo Crie somente os diretórios requeridos pela especificação do orquestrador. Não crie sub-levels de diretórios ou reports, a não ser que tenha uma especificação. Ignore a lista... Qualquer tipo de lista antes de ler. Ou seja, nunca faça o parciamento, escaneie os arquivos que estão em qualquer pastas, dentro desse parâmetro ignore folders. Por quê? Lá embaixo eu vou mostrar para você como é que vai ser o comportamento. E inicialize o manifesto.md do orquestrador dentro do diretório em branco com a seguinte estrutura, título, o caminho absoluto, o agente e o timestamp. Porque esse cara aqui que vai medir o que já foi feito. E agora aqui eu tenho a fase 2. Por exemplo, inicialize na fase 2 uma tarefa para o auditor de dependências e o architectural analyzer. E eu estou falando aqui em parallel. Ou seja, eu estou falando para o Cláudio aqui nesse caso, olha, na hora que você chegar nessa fase 2, suba dois agentes de uma vez. Eu não preciso rodar primeiro o auditor e depois o de arquitetura. Então, o lance aqui é importante. E aqui eu separo essa tarefa em duas partes. Parte 1, auditor. Ele faz um relatório completo de dependências no sistema, baseado na especificação do agente, importante for a dependency validation nessa tarefa. Use o MCP servers como o Context 7 e o FireCrawl para verificar as versões. o nível de manutenção, o status de manutenção, as vulnerabilidades ali daquele pacote. Então, perceba que essas instruções aqui vão ser passadas para esse agente auditor. Então, por isso que eu estou colocando o que tem que ser passado de informação. E aqui, o cara de análise de arquitetura, que vai produzir um relatório completo de arquitetura seguindo as especificações do agente. somente o orquestrador vai guardar informação no manifesto.md quando cada tase completar. O que isso significa no final das contas? Que o cloud.md não vai sair modificando o manifesto.md. Aqui é a parte mais interessante, na minha opinião, que é a fase 3. Uma vez que eu tenho esses dois relatórios gerados, essa fase 3 depende principalmente desse relatório aqui, do relatório de arquitetura, porque nesse relatório de arquitetura a gente tem os componentes. Então, aqui na fase 3, ele vai fazer um agente em paralelo para analisar o componente de uma forma específica. Um por componente. Então, faça parte do report de arquitetura, que foi feito na fase 2, tratando isso como um artefato pelo Architecture Analyzer. Também, para cada componente listado, por exemplo, na seção Critical Component Analysis, na sessão ou em outras sessões que mostrem componentes, inicie um agente separado, Task Deep Analyzer, para cada componente em paralelo. Para cada tarefa, você tem que analisar somente o componente que foi passado para esse cara. Você tem que cobrir... Aqui eu estou dando um exemplo para ele. Por que eu estou dando um exemplo? Porque às vezes ele não entendia que era para ele gerar um relatório por componente. Então, fui mais específico. Ou seja, como ele vai fazer a cobertura? Se o relatório de arquitetura tem 10 componentes, você precisa rodar 10 agentes em paralelo na execução, gerando, então, 10 relatórios. Nenhum componente pode ser escapado, pode ser pulado. Depois que essa tarefa foi feita, as execuções completas, você precisa verificar se todos os reportes foram feitos. Então reabra o arquivo e reveja essas seções linha por linha. E se algum componente não foi feito o report, faça, gere mais um Deep Analyzer para executar até que a cobertura seja de 100%. Vamos imaginar que o Cloud delirou em algum momento e ele esqueceu um componente. Então aqui é uma forma de eu reverificar se realmente todos os componentes foram feitos. Então é uma parte de análise. E aqui eu coloquei o importante, tenha certeza que você não vai duplicar o report. E aqui eu usei uma palavra-chave, principalmente para o Cloud, que é UltraThink. UltraThink vai fazer com que ele pense de uma forma ainda mais estruturada, para ele conseguir perceber que não existe, para ele não duplicar relatório. Por quê? Às vezes ele vê um relatório com uma data e hora, e ele pode ler e ver que esse relatório não existe, e ele acaba podendo até duplicar relatório. Isso aconteceu comigo. Então, eu pedi para ele verificar com UltraThink mesmo, para ver se existe algum relatório já criado com nomes similares com timestamp etc Eu falei voc tem que ser extremamente preciso nessa verifica A fase 4 para fazer com que o orquestrador nosso pegue todos os relatórios gerados e finalize o manifesto como MD para ter todos os relatórios gerados. E aqui, a fase 5 é pedir para ele, o Cloud Code, ler o manifesto, validar que todos os arquivos existem, salvar um arquivo readme com esses detalhes dentro do diretório do orquestrador. Lembrando que o orquestrador agente é somente mais um especialista, que faz o setup na fase 1, a síntese na fase 4, e ele não coordena os agentes, porque esse é o job dele, o Cloud Code. E aqui, galera, eu coloquei exemplos de utilização. Então, aqui, execution, cadê aqui? Exemplos de utilização. Então, aqui é o seguinte, galera, como eu vou chamar esse comando no Cloud Code eu posso passar parâmetros para deixar mais claro para o agente o que eu quero fazer então eu estou colocando use os argumentos que vão ser passados ali para a gente conseguir setar pastas de entrada pastas de saída e etc então eu falei o seguinte, nunca use nenhum outro caminho para salvar relatórios, arquivos ou manifestos a não ser que eu passe especificamente pelo usuário para ele não criar também subfolders chamado reports, outputs ou qualquer coisa desse tipo. Nunca crie nenhum outro arquivo que não seja especificado pelo agente. Siga o seguinte padrão de output. Então, o que acontece é o seguinte. Eu estou definindo aqui como que eu vou rodar esse comando. Então, eu posso rodar esse comando para ele fazer essa chamada direta no Cloud Code, ou eu posso fazer o seguinte, rodar o workflow no projeto somente na pasta que eu quero. Então, eu posso passar menos menos project folder e passar a pasta. Isso vai fazer com que ele faça análise somente dentro daquela pasta. Às vezes eu tenho um monorepo, eu quero analisar um projeto só daquele monorepo e não todos. Outra coisa que eu pedi para ele fazer também é fazer o seguinte, eu poder especificar qual é a pasta de saída que eu vou querer, porque por padrão está barra docs, barra agente e barra o nome do relatório. Aqui eu estou falando para ele seguir o output na pasta que eu passei. E não menos importante, eu também pedi para ter um parâmetro onde eu passo para ele ignorar alguns arquivos. Então, imagina que tem pastas que você acha que não vale a pena ele analisar, que tem outra coisa que não tem nenhum sentido, então você consegue dar um Ignore Folders para ele ignorar e não analisar essas pastas. Instruções negativas, de uma forma bem forte, nunca modifique o codebase, não faça upgrades, não invente CVIs, não use linguagem vaga, não use emojis, não provide timestamp, perceba que essas instruções negativas, elas são muito parecidas com as que a gente já foi, aqui eu só fui, trouxe, organizei mais os bullets para ficar mais claro aqui para ele e trouxe também observações e novamente eu pedi aqui para ele, ultra think pense passo a passo, aqui eu já estou usando a chain of thoughts, para determinar de forma mais clara a instrução para que cada agente possa completar a tarefa. Por que eu estou dizendo isso? Porque o Cloud Code, ele vai ser responsável para chamar um agente. Para ele chamar esse agente, ele tem que mandar uma mensagem. Para essa mensagem ser mandada, essa mensagem tem que ser muito bem pensada para ele não passar simplesmente de uma forma bem vaga e esse cara não vai fazer um bom trabalho. Então, eu estou pensando aqui para ele, falando o seguinte, você como coordenador, master, you você tem que prover toda a informação necessária de contexto para cada agente para garantir que todo agente consiga entender passo a passo o que ele precisa fazer o agente orquestrador ele vai sempre fazer um apende no manifesto imediatamente, toda vez que o agente terminar e basicamente é isso mas eu acho que dar observação aqui galera esse é o passo mais importante porque aqui eu estou pedindo para ele realmente refletir tudo o que ele precisa passar para o agente que ele vai chamar para garantir que não vai passar instruções faltantes fazendo com que esse agente não consiga concluir o trabalho dele. Isso aqui que eu estou passando para vocês, pessoal, nesse prompt não é somente para esse tipo de contexto. Isso aqui é muito utilizado em Prompt Engineering quando você está trabalhando em aplicações multi-agênticas. e normalmente, inclusive a gente seta um formato de chamada de um agente para o outro muitas vezes a gente chama de a gente faz uma chamada em JSON falando, você vai passar isso, isso o next step é isso, a observação é isso para garantir um protocolo claro de comunicação, nesse caso a gente não está fazendo isso tá? Então sei que ficou grande esse vídeo mas era importante você entender essa parte aqui E aí", "data": "2026-01-14 11:02:32"}}}