{"_default": {"1": {"origem": "youtube", "titulo": "Os 3 Layers da IA que todo desenvolvedor precisa saber", "texto": " Direto vem uma galera nova aqui em casa pra eu conhecer e tudo mais. E daí eu pergunto assim pra eles, cara, com o que você trabalha? E eles falam assim pra mim, eu trabalho com TI. Eu não sei se você já passou por esse tipo de situação, mas falar que trabalhar com TI é a coisa mais abrangente do mundo nos dias de hoje. E o porquê que eu tô falando isso? Porque hoje em dia, você falar que trabalha com o IA é quase a mesma coisa de a gente falar que a gente trabalha com TI. De tão amplo que é toda essa parada. E eu tenho que admitir pra você que todas as vezes que eu ouvia falar em inteligência artificial, isso já me remetia a ciência de dados, machine learning, deep learning, ficar treinando modelos, e isso tava tão fora, mas tão fora da minha bolha, que simplesmente esse assunto nem me interessava muito. Obviamente que eu tentava ter uma base, né, me terar um pouco sobre isso, mas de forma geral, zero profundidade nesses tipos de assunto. Até a todo esse boom que a IA vem fazendo no mercado e agora falando diretamente com desenvolvedores. E por que eu estou falando isso? Porque na newsletter do The Pragmatic Engineering saiu um artigo muito interessante falando sobre os três layers da IA. E quando eu vi isso, trouxe uma clareza extremamente forte para mim, porque esses layers mostram exatamente onde nós desenvolvedores, nós nos encontramos agora nesse universo da IA. Então vamos falar sobre isso hoje. Eu não tenho dúvidas que vai ficar tudo muito claro na sua mente quando a gente fala sobre IA, o nosso papel e talvez a redefinição da nossa profissão. Mas, seguinte, antes da gente ir direto ao assunto, eu queria já pedir para você dar um joinha nesse vídeo, se inscrever aqui no canal e também escreve aí um comentário, né? Você já está trabalhando com o IA? Já está passando raiva? Está feliz? Está sendo mais produtivo? E também se você já está desenvolvendo aplicações e agentes para a IA. Coloca aí a sua opinião como é que está sendo essa jornada aí para você como desenvolvedor. E, obviamente, galera, não posso deixar de citar, aqui na Full Cycle, nós acabamos de lançar um MBA em Engenharia de Software com IA. É o único MBA no mercado hoje em dia que tem o foco exatamente no desenvolvedor. Então, se você quiser saber mais, clica aqui no link aqui abaixo, você vai bater um papo com a nossa equipe, vai entender, inclusive, no site com todos os detalhes que a gente está trazendo para você. Então, aproveita, dá uma olhada, porque tem bastante coisa interessante que vai fazer sentido para você. Maravilha? Mas, galera, sem mais delongas, deixa eu trazer aqui esses três layers da IA, e é importante inclusive eu citar aqui o artigo que saiu, chama de AI Engineering Stack. Basicamente, ele traz três camadas de como é que funciona esse mundo de AI Engineering nos dias de hoje e como que isso acaba se diferenciando, por exemplo, da parte de Machine Learning e até mesmo aonde fica o papel de full stack developer no meio de toda essa história, tá? Então, recomendo que você dê uma olhada aqui nesse artigo, tá? De qualquer forma, o que eu fiz foi pegar umas partes desse artigo pra gente discutir aqui e também eu trouxe algumas observações e coisas que eu acredito pra onde que o mercado tá indo hoje. Então, vale a pena a gente discutir sobre isso, porque esse assunto cada dia mais é importante, principalmente para você desenvolvedor saber aonde você está nesse mundo da parte de engenharia de software com IA, beleza? Então é o seguinte, três camadas interessantes que ele traz aqui. E começando de baixo para cima, ele tem a camada de infraestrutura, onde foca bastante na parte de computação, né? Ou seja, como essa parte de infra, computação, GPUs e tudo mais, acaba impactando numa profissão onde cada vez mais as pessoas têm que estar especializadas também nesse mundo de IA. A segunda camada aqui é a parte de Model Development. E, honestamente, era aqui onde parar, acabava todo o meu interesse com inteligência artificial. Focava muito na parte de ciência de dados, machine learning, treinar modelos, entender se os modelos estão realmente confiáveis, entender a parte de inferência. Então, tem muita coisa que é uma bolha completamente diferente. Inclusive, ele traz alguns pontos aqui bem interessantes, fazendo uma coisa versus outras. Ele fala assim, AI Engineering versus Machine Learning Engineering. O que ele fala é que, basicamente, a parte de engenharia com o IA, ela usa modelos que outras pessoas treinaram. O que significa? Que a parte de IA Engineering, ele foca menos na parte de modelagem e treinamento e mais na parte de adaptação do modelo. E essa adaptação do modelo é utilizar os modelos que a gente tem hoje, adaptando, e a gente vai falar um pouco mais sobre isso daqui a pouco, tá? Pra gente poder trabalhar. E uma outra coisa aqui que ele coloca é que a parte de AI Engineering, né? Ele acaba trabalhando com modelos muito grandes e que tem um open-ended outputs. Ou seja, são outputs extremamente abrangentes, que é o que acontece quando a gente tá trabalhando com esses modelos grandes. Então é algo muito diferente de, isso é um cachorro, isso é um gato, né? Isso é um spam, isso aqui é uma mensagem com esse sentimento. Não, as coisas vão muito mais, de forma mais abrangente, onde um modelo a gente pode perguntar para ele sobre programação, sobre medicina, e ainda assim ele consegue trabalhar. Então, tem algo bem interessante aqui que ele mostra, que é uma separação bem interessante quando a gente pensa em Machine Learning Engineering, onde o foco está no dado, depois o modelo e depois o produto, e a parte de AI Engineering, onde a gente tem o produto central, como centro do que a gente precisa, que utiliza dados, que ali vai utilizar modelos. Então, isso aqui é extremamente importante para a gente se ligar. Nós desenvolvedores, nós estamos nesse layer aqui, onde ele fala sobre AI Interface Prompt Engineer Context Construction e Evaluation Vamos dar uma olhada porque aqui que a coisa fica interessante para a gente entender qual o local em qual layer a gente est nesse momento Então, vamos lá. Application Development in AI Engineer. Então, uma das coisas extremamente importantes é a gente entender que as interfaces que a gente está acostumada a utilizar nos dias de hoje, elas estão sendo reduzidas. Então, quando a computação evolui, a gente diminui interfaces. A gente tinha computadores grandes, depois a gente tem computadores menores, depois a gente tem celular, depois a gente tem relógio, depois a gente tem óculos. E, por muitas vezes, a gente só vai ter um simples áudio, onde muitas coisas vão acontecer por baixo dos panos. Então, a AI Interface é a interação com o usuário final. E quando eu coloco aqui usuário final, é que esse usuário, normalmente, é o user e trabalha ali no modelo. Então pode ser um client, e esse client pode ser um humano, ou pode ser uma outra IA, ou pode ser um software chamando essa IA. E aqui ele coloca algumas categorizações, como Standalone Software, que trabalha especificamente com IA como um chat GPT da vida. Ele tem Embedded, onde você tem, por exemplo, um GitHub Copilot, que funciona como uma extensão do VS Code, ou seja, você plugando IA num software existente, e chatbots que você consegue ali conversar e trabalhar ali com a IA o tempo todo, né? E muita gente acaba confundindo agentes de IA com chatbots de IA. E são coisas extremamente diferentes. Na realidade, você pode ter um chatbot como um agente, mas não necessariamente todo agente é um chatbot. Depois a gente vai falar um pouco mais sobre isso, tá? Outro ponto importante é a parte de Prompt Engineering e Context Construction. Galera, eu acho que nós estamos num momento que é o seguinte, sabe aquela história? Todo mundo sabe que fazer exercício faz bem para a saúde, mas isso não significa que todo mundo faz exercício. É a mesma coisa com Prompt Engineering, tá? Todo mundo, eu acredito, que já tenha trabalhado com o IA e esteja num processo ali evolutivo, sabe o quão importante é saber o que pedir para a IA e o contexto que você tem que dar para ela, para ela entender o que você realmente está querendo. Mas não adianta apenas saber disso. O importante é você conseguir trabalhar ativamente para isso, você entender realmente os tipos de prompt, a ideia, a estrutura, o conceito, como eu gero contexto para uma IA, quais são os tipos de documentação, quais são os tipos de docs que a gente utiliza para programar. Então, isso é extremamente complexo muita gente acaba subestimando e simplesmente os resultados mudam completamente. Então, quando a gente está falando em Prompt Engineering e Context Construction, normalmente a gente está falando em controlar o comportamento do modelo, ou seja, tentar minimizar um comportamento maluco que o modelo pode ter se você não souber pedir para ele e não der o contexto exato ali para ele. Tem um exemplo bem interessante de um benchmark que foi feito em relação a um dos lançamentos do Gemini da Google. E o que acontece? Eles, nesse benchmark, eles conseguiram mostrar o quanto que o Gemini estava naquele benchmark acima do GPT-4, por exemplo. E o resultado foi fantástico, 90% em relação de performance, batendo o GPT. Porém, o que aconteceu? Depois disso, conseguiram perceber que a Google tinha utilizado como uma forma de prompt algo chamado de COT Chain of Thoughts at 32. Basicamente dando diversos exemplos de como resolver os problemas. Se não me engano, 32 exemplos. Então você começa a ver como que o Gemini conseguiu superar o GPT em relação a isso. Por quê? Porque aqui no Gemini eles utilizaram um prompt de chain of thoughts com os 32 exemplos. E no benchmark que a OpenAI tinha saído soltado com o GPT-4, ela tinha dado 5 exemplos. Ou seja, foi de 90% para 86% e daí foi bem ali expressivo para o Google falando que bateu um modelo ali da OpenAI. Porém, quando perceberam que o Google trabalhou com um prompt mais específico, dando mais exemplos para o modelo, aí a coisa mudou. Por quê? quando eles fizeram a mesma coisa com o GPT-4, o GPT-4 melhorou também a qualidade, utilizando essa quantidade de exemplos que ele deu. Agora, olha só que interessante, o próprio Gemini, quando ele deu ali 5 shots, com 5 exemplos de como resolver para passar nesse benchmark, ele teve ali 83% de performance contra 86% do GPT-4. Ou seja, nesses exemplos a gente consegue ver o quanto que um prompt consegue modificar completamente a qualidade do resultado. Quando o Gemini foi dado exatamente os 5 shots que foram dados para o GPT, o GPT saiu melhor no meio da história. Para você ver como que isso muda completamente, até mesmo os benchmarks que são feitos em relação aos modelos. Então, meu amigo, minha amiga, se você não está preocupado com os prompts que você trabalha, se você não estuda os prompts que você... os tipos de prompts que existem, por exemplo, simplesmente os seus resultados vão ser ruins e você vai ficar xingando a IA o tempo inteiro, tá? E aqui a gente vai para a parte de evaluation. E essa é uma das partes que eu acho que muitos devs têm um awareness muito baixo, né? Eles n conseguem ainda se ligar do novo momento que a gente t Por qu Porque quando a gente est falando em evaluation ou seja verificar o resultado que a gente está tendo com a implementação e a utilização de A, a gente está falando muito em diminuir risco. Novamente, a gente trabalha, a gente está acostumado com ifs e else's de forma extremamente determinística. A gente consegue controlar completamente o fluxo da nossa aplicação. Quando a gente vai trabalhar com o IA, isso cai por terra, porque a IA, muitas vezes, ela toma decisão própria e ela acaba entrando numa exceção que a gente nunca previu. Então, a gente tem que tentar diminuir os riscos e isso, a gente está nessa fase de evaluation. Então, a gente consegue fazendo isso, inclusive, selecionando os modelos certos, especializados. a gente tem que conseguir cortar custo, a gente tem que entender as janelas de contexto, a gente tem que entender sobre tokens, os embeddings, a gente trabalhar com os protocolos, e tudo isso tem a ver com o tipo de modelo especializado naquilo que você quer fazer, e inclusive ajudando a sua empresa a economizar, porque não adianta você pegar o melhor modelo do mundo e daí de repente você gastar uma fortuna. Então você tem que fazer benchmarks, fazer as comparações. A forma de como você faz o deployment também dos seus agentes, por exemplo, muda quando a gente está trabalhando com IA. E também a parte de oportunidade de melhoria. Essa parte de oportunidade de melhoria, a gente não está falando de melhorias necessariamente só do software. A gente está falando de melhorias do resultado que a IA está gerando para mudar o comportamento do nosso software. Então, é algo extremamente mais específico para os resultados, para a gente conseguir verificar. Então, muitas vezes, você sobe um software e você começa a verificar que você tem um determinado problema. E você vai lá e faz o quê? Muda apenas o prompt. Ah, melhorou um pouco. Deixa eu mudar de novo esse prompt. Às vezes, somente nessas mudanças sutis, você já tem ali resultados extremamente expressivos de melhorias dentro do software. Show? Agora, galera, novamente é o que eu tenho batido muito na tecla, tá? A IA mudou como os desenvolvedores criam o software. Ou seja, mudou como desenvolver software. Ou seja, hoje em dia a gente consegue ser muito mais produtivo. Então, eu consigo tirar dúvidas, eu consigo gerar os meus testes automatizados, eu consigo refatorar, eu consigo analisar bugs, consigo criar novas features, consigo trabalhar em modo agente onde o software vai programando para você. E no final das contas, o que acontece é que a gente está num momento de redefinição do nosso papel como desenvolvedor. Então, cada dia a gente tem mais código e quanto mais código, menos valor o código vai ter. Não estou dizendo que o código não é importante, ele é base para o nosso software funcionar. Mas cada dia mais a IA vai gerar código melhor, cada dia mais a IA vai gerar código mais rápido e cada dia mais você não vai conseguir disputar. É a mesma coisa você tentando disputar uma corrida contra um robô que é especialista em correr, por exemplo. A gente não tem esse robô ainda, mas eu acho que deu para você entender a ideia. Então, o que vai acontecer? O que já vai acontecer? Não, o que já está acontecendo? As empresas estão precisando de desenvolvedores que tenham conhecimentos mais sólidos, principalmente em arquitetura, tá? Ou seja, eu tenho mais repertório, eu tenho mais experiência, eu consigo, na realidade, pilotar a minha IA para eu conseguir extrair o melhor dela na hora de eu desenvolver meu software. E para isso, obviamente, o que acontece? Você não precisa apenas entender de arquitetura de software e desenvolvimento. Você também precisa entender como a IA trabalha, como eu consigo ter um workflow decente para eu conseguir trabalhar com o IA. Eu acho que muitos desenvolvedores ainda estão naquele momento que ele pega o Cursor, o VS Code, o Copilot, o Windsurf, e escreve algo do tipo, eu tenho esse problema, realize, resolva esse bug. Eu tenho isso, ou seja, está arranhando a ponta do iceberg. E hoje em dia a gente tem já metodologias extremamente fortes com workflows, com prompts corretos que você faz para cada tipo de atividade fazer a IA programar de forma diferente. Então, o desenvolvedor que não conseguir acompanhar e aprender de forma profunda como realmente ser mais produtivo com o IA, também vai ficando para trás, galera. Então, a gente não está falando ali da substituição da empresa falar Wesley, você vai ser demitido pelo MyA. Mas, obviamente, você está trabalhando em uma equipe onde todo mundo é cinco vezes mais produtivo do que você. O que vai acontecer? Então, esse aí é o grande ponto. Mas lembrando, aqui, ainda em application development, isso aqui está mudando como a gente desenvolve software. Agora, o que está mudando também é qual é o tipo de software que a gente desenvolve. Novamente, a gente vai para aquela parte do AI interface. Ou seja, a gente vai pegar as aplicações que nós já temos e a gente vai integrar essas aplicações com o IA. E aí muita gente se engana pensando que é Só botar o SDK, sei lá, da OpenAI, da Google, e fazer as chamadas, e ter o chat completion, e fazer alguma coisa. Mas, assim, tem muito mais coisa que abrange trabalhar e plugar IA no software da empresa que você já está. Acaba sendo um universo quase que paralelo para quem não estudou isso a fundo. E o fato é que você, que é desenvolvedor, você precisa agora aprender a fazer isso, porque eu duvido que daqui para frente os softwares que a gente está acostumado a trabalhar não vão ter IAs ali embutidas nele. Acho muito dif no sistema no CRM da sua empresa no sistema no RP no sistema de relat nos processos que o seu sistema executa a gente n v daqui para frente a IA embutida E quem vai instalar Quem vai programar para essa IA trabalhar dentro do software que voc j tem Provavelmente é você desenvolvedor, logo você vai ter que aprender a fazer isso, e não apenas aprender a fazer isso, fazer isso muito bem. E aqui a gente entra num outro tipo de aplicação que a gente tem que aprender a desenvolver, que é o desenvolvimento de agentes. E, galera, sim, a gente é um software também, tem código, você faz deploy, etc. Mas, normalmente, quando eu falo de agente de A, eu me lembro mais ou menos há uns sete anos atrás, quando eu falava e tentava explicar o que era um microserviço. Poxa, microserviço é um software, ele roda de forma autônoma, ele faz isso, ele faz aquilo. E a galera falava, pô, mas é um sistema normal, né? E como os outros sistemas. Então, gerou-se muito a discussão do que era o microserviço, qual era a diferença de um sistema normal para um sistema com microserviço. E hoje, eu sinto que a gente está mais ou menos nessa mesma pegada, mas com agentes de IA. Eu percebo que ainda há muitos desenvolvedores que não conseguiram entender a diferença de você pegar uma IA e adicionar dentro da sua aplicação e de você desenvolver um agente de IA e que não é um chatbot. Ou seja, a gente de A acaba sendo uma entidade dentro de um software onde ele consegue perceber o ambiente. Ele sabe o que ele tem que fazer, quais as ferramentas que ele tem, qual contexto que ele está e qual a especialidade dele. Ele consegue planejar as ações que ele vai fazer para conseguir resolver determinadas tarefas. E ele toma a decisão de forma autônoma. De acordo com o que acaba chegando ali para ele, ele vai rodar ali a LLM, vai pegar um determinado resultado, baseado nesse resultado ele pode chamar uma ferramenta, ele pode chamar um servidor MCP, ele pode chamar um outro agente, ele pode delegar aquilo, ele pode retentar. Então, vai depender muito de como que o agente trabalha. Então, basicamente, a principal diferença de uma aplicação que usa IA e de um agente de IA é que o agente é o núcleo para a tomada de decisão da aplicação. Ou seja, quem define o que a aplicação vai fazer e como ela vai se comportar, em qual if, em qual else, em qual situação que ela vai trazer, é a IA. Não é mais você, de forma extremamente determinística, que faz isso dentro do seu software. Ou seja, e ela não trabalha apenas de forma reativa. Ela consegue trabalhar de forma proativa, desenvolvendo, tomando ações, tomando cada vez mais decisões. No último Microsoft Build que teve, a Microsoft mostrou um agente de SRE, depois eu posso até trazer aqui no canal para vocês, mostrando um agente percebendo que há um sistema ali com um problema, onde está tendo um problema ali no Redis, e daí o agente começa a verificar, e daí ele consegue perceber o problema, e daí de repente ele fala, esse sistema aqui está fora, não está com a rede aberta disponível, você quer que eu abra, o cara dá um clique e o agente já fez tudo isso e conseguiu resolver um problema basicamente sozinho, tá? Sem a gente ter que ficar debugando e fazendo esses tipos de coisa. Agora a gente já tem o Copilot, você pede pra ele fazer Code Review, o Codex, a Cloud que lançou agora recentemente da OpenAI, fazendo essas tarefas em background no formato de agente. Então a gente vai precisar aprender de verdade a desenvolver agentes. Existem diversos frameworks, existem equipes de agentes frameworks que coordenam diversos agentes que vão conversar entre si em linguagem natural na maioria das vezes para eles conseguirem realizar diversas tarefas então daqui para frente galera se você não souber implementar IA nas aplicações que você trabalha, se você não entender o que é um agente, como desenvolver um agente sem dúvidas você vai começar, como eu digo eu não quero dizer que você vai ficar para trás mas basicamente é que a tecnologia ela sempre evoluiu a gente sempre teve que aprender coisa nova e tá aí mais coisa nova que a gente tem que aprender pra conseguir entregar em qualquer lugar que você vá trabalhar pra você manter aí a sua carreira up to date, vamos dizer então você tem que aprender a desenvolver software com IA e colocar IA nos softwares que você desenvolve, incluindo fazendo agentes, então galera gostaria que você refletisse bastante nesses pontos que eu trouxe e principalmente que você entenda agora que no mundo gigante que existe na parte de inteligência artificial, a gente está nessa camada. Então, para você trabalhar com o IA hoje, você não tem que ser especialista nesse cara. Você não tem que necessariamente entender deep learning, machine learning, como treinar modelo, esse tipo de coisa. É importante você saber sempre layers abaixo, mas a sua prioridade hoje como desenvolvedor está aqui, tá? Então, essa é a dica, eu acho que é o grande ponto que eu queria trazer aqui nesse vídeo pra você. Maravilha? E galera, deixa aí os seus comentários pra dizer pra mim o que que você está fazendo já com o IA nos dias de hoje, tá? E novamente, tô deixando um link aqui abaixo caso você queira aprender mais sobre engenharia de software com o IA no MBA que a gente lançou recentemente da Full Cycle, tá? Então clica no link pra você conferir todos os detalhes tudo que a gente tá cobrindo nesse MBA você pode fazer sendo formado ou não sendo formado, a gente tem diversas opções, a gente tem uma faculdade, e o MBA que a gente fez, ele é especificamente para desenvolvedores, focando exatamente aqui nessa camada que eu acabei de falar aqui para vocês, beleza? Então é isso aí galera, grande abraço para vocês, e até o nosso próximo vídeo aqui no canal Full Psycho. Legenda Adriana Zanotto", "data": "2025-08-02 12:51:57"}, "2": {"origem": "arquivo_local", "titulo": "1-O que é Gen IA.mp4", "texto": " alguma coisa lá interessante, eu falei, poxa, isso daria o nome de um filme do Will Smith, e eu só peguei, opa, e eu só peguei o meu chat de EPT, e mandei rapidinho no celular assim, ó, com base numa, promptei ali umas quatro, cinco linhas, falando pra ele gerar o que a gente tava discutindo pra um filme do Smith, com um ator muito parecido com o Smith, o Chad J.P.T. tem alguns guardrails de tentar não usar imagens conhecidas então dependendo de como você coloca ele fala que não pode fazer aquilo para não gerar imagens distorcidas fake news, etc. eu acho isso bem interessante e daí quando você coloca desse jeito ele criou perfeitamente igualzinho as ideias de capas de filme que o Smith já participou, por exemplo como a Procura da Felicidade ou filmes desse tipo mandou super bem então ele já consegue muito rápido foi muito rápido, um prompt de 3, 4 linhas acho que por aí, 3, 4 linhas e com isso ele já conseguiu criar muito bem então assim, a geração de imagem já está muito além do que a gente podia imaginar já consegue fazer coisas impressionantes isso para a imagem imagem parada, nem estou falando de filme acho que faz um tempinho agora, deve ter um mês mais ou menos lançou o novo gerador de vídeos lá da Google V3. Meu, incrível, gente. Incrível. Ele gera muito bem os vídeos. Ele ainda comete alguns erros assim como gerador de imagens tamb comete Eu j vou falar um pouco disso mas gera muito bem Ent por exemplo geradores de imagem ele tem dificuldade de gerar tamanhos ideais então, por exemplo, se você der muita especificação de tamanho, por exemplo, dali se perde um pouco. Mas tem outras aplicações que estão fazendo um pouco melhor isso. Se você der texto para colocar dentro da imagem, ele erra de vez em quando a acentuação, ele erra de vez em quando e perde uma palavra, então você tem que sempre revisar, isso é importante. Então tanto texto quanto imagem você tem que revisar. O texto normalmente sai mais coerente. Se você colocar os guardrails certo, sai mais coerente. Imagem ainda dá uma outra falhada ali. Mas manda muito bem. Assim como nos vídeos que eu falei, por vezes ele perde uma mão. Dá para ver se você ficar atento, você vê alguma falha na finalização dos vídeos, nos detalhes de finalização. então isso acontece ainda mais pouquíssimo e tem ficado cada vez melhor a IA também consegue gerar código, putz, código tá gerando bem, eu coloquei aqui o Copilot, que gera trecho completo, mas o Devin tá mandando bem exaço humanos também tem outros geradores de código que também mandam muito bem, de verdade se você não tá usando porque você tem algum tipo de preconceito usa, é que você tem que saber prontar, se você for lá e colocar um monte de besteira vai sair besteira. Outra coisa, se você não sabe codar, você vai pedir errado também, então tem que pedir certo as coisas que você quer, mas ele faz muito bem. Audio e m sendo muito honesto eu uso pouqu para audio e m mas ele consegue criar sim sons ali que s muito parecidos com naturais E a gente consegue criar inclusive eu criei ali algumas vinhetas para algumas pe minhas que eu preciso E ele faz isso muito bem. Então, tem bastante espaço aqui também. Ou seja, o que a IA já consegue fazer? Ela já consegue transitar em tudo isso. E também, ela consegue, querendo ou não, ter um conversacional com a gente. quando a gente fala de uma Alexa, quando a gente fala de uma IA de auxílio do dia a dia, também tem essa interação social de conversação, que é bem legal. E vamos lá, qual que é uma outra ideia do conceito fundamental que eu queria trazer para vocês? Ela tem um conceito de Deep Learning, que é um aprendizado profundo, a gente vai falar um pouco disso, com modelos probabilíticos e alguns algoritmos que são sofisticados para a atenção dessa IA, que vai deixar criar novos exemplos baseados no que ela aprendeu, ou seja, ela foca em um assunto que você está pedindo para ela com base em um monte de dados, que é nada mais do que categorizar os dados, compreendê-los, usar os dados que você está pedindo, ou seja, comparativo de texto que é super importante e com base nesse comparativo textual ela consegue entender para onde você quer caminhar, ou seja, ela consegue compreender com base nas palavras que ela lê, qual é a direção que você está indo de um texto. Assim como o ser humano faz, certo? Porque se eu chegar para você e falar, por exemplo, sobre alguma palavra, deixa eu tentar pensar em alguma aqui alguma palavra que pode ser usada de diversas maneiras voc j vai se preparando para entender o que vai vir depois vai vir depois vai vir depois e ver o contexto daquela informa Então a IA consegue fazer a mesma coisa hoje, com base nisso ela consegue tomar atenção e seguir na geração de resultado. Então aqui, por exemplo, eu estou tentando pensar uma palavra, está difícil de pensar uma palavra, mas a gente tem tantas, quando a gente quer lembrar não vem, mas pensa no seguinte, Imagina que eu vou falar sobre assado. Posso usar assado, por exemplo. Eu posso falar que a palavra assado em si, ela não diz nada, né? Porque eu posso falar que eu comi um frango assado. Eu posso falar que eu fiquei com, sei lá, a minha pele assada. Eu posso falar várias coisas, porque o assado pode ser usado de várias maneiras. Ou tem várias outras. Acho que esse exemplo ficou horrível, mas já tem dois aqui. Já dá pra gente brincar. Então tá vendo aqui que quando eu vou falar sobre assado, eu posso estar falando sobre comida, eu posso estar falando sobre a nossa pele, por exemplo. Então, está vendo que se fosse no modelo de IA, ele precisa compreender para que lado você está indo, para entender o contexto, focar e conseguir te dar uma resposta que faça algum sentido, não mandar você, por exemplo, colocar azeite na pele e colocar um protetor solar no frango. Então, ele precisa conseguir compreender isso. A mesma coisa que a gente faz, querendo ou não, o que a gente faz é compreender o contexto geral, total, com base nas informações que a gente está chegando e na probabilidade que a gente tem de frases futuras. Então, com base nisso, a gente consegue ter modelos que conseguem criar novos exemplos com base no que ele aprendeu.", "data": "2025-08-02 13:25:07"}}}